[
  [
    "Matthew C.",
    "The keyboard is an amazing deal - the metal frame is a tank!",
    "This is a great keyboard frame (and the keys and the rest of it aren't bad either).For just over $50, an amazing steal.I had been using the Kraken bred Pro, which after a few months of use (and one accidental drop) wasn't registering all the keys as it should.  I bought this GK61 as the base board/keys etc. are the same on all these GK61 models (which is what the kraken is, just prettied up) and swapped the kraken key set to this one (the kraken keys are a little chalkier feeling, which is desired for the pbt type, although this board has pbt keys, they felt a little smoother like abs).With my hybrid combo of both boards, I've been quite happy.",
    5.0
  ],
  [
    "Rich Vara",
    "So close to being the best keyboard under $100",
    "amazing aluminum case, good stock switch options, surprisingly good stock keycaps, but with very difficult to tune stabilizers (if you can spare $10 to buy durock plate mount stabs i’d recommend it), and VERY limited options for future switch upgrades with gateron optical standard (only 6 or 11 if you count silent versions). If aeon made a version of this board with a pcb that supports mechanical switches at a similar price point i think it’d be very hard to beat.",
    4.0
  ],
  [
    "Tee",
    "Great for the price.",
    "(My first mechanical keyboard was the EPOMAKER SKYLOONG SK61 so I'll be comparing this against that for reference.)Keycaps: I immediately swapped these out for another set, they're good and functional but not the most \"aesthetic\". No real problem beyond personal preference.Case: Much, much heavier than the SK61 which I love. Doesn't slide around at all on a deskmat and you can keysmash away to your heart's content. No idea what I'm going to use the 2nd port for but it's nice to have.Switches: It came with Gateron Yellows. They work! I swapped them with Gateron Blacks to test the board and nothing went wrong.Cable: It works; not a lot to say on this one besides the fact that, like the keycaps, I'm probably going to swap it out for one that looks slightly nicer. Has a velcro cable tie which is convenient.Stuff in the Box: It comes with a plastic keycap and metal switch puller. I don't recommend using these because while they're inexpensive, I found the keycap puller left black marks on my white keycaps, and the metal switch puller was just painful to use and even flew out of my hand a few times.AEON configurator/driver: Trying to go to the link in the manual (aeonuniversal dot com) sent me to a safebrowse alert page, as does scanning the qr code on the back. Thankfully the SK61 software recognizes the keyboard and is basically identical (minus the logo) to the screenshot on the product listing.Overall Review: This is a great keyboard for the price. The case is great and everything is functional out of the box, my only issues were with the included pullers, the flagged link/QR code, and the aesthetics of the keycaps & cable.",
    5.0
  ]
]
