[
  [
    "John Alone",
    "Loudest thing in your house",
    "This keyboard feels solid, and the RGB animations are splendid. I didn't buy it for the RGB at all though, I bought it for the reviews, the sale price, and I wanted to see what a mechanical keyboard is like.4/5 stars because IT'S SO DAMN LOUD!!  I never could've imagined a keyboard with keys that make this much sound. It's simply ridiculous. At first I thought it was just me, since my last two computers were Mac Book Pros. So I took it to work (I'm a software developer) to let other people experience this concert of keys. I was immediately asked to stop what I was doing. My coworkers simply could not believe what they were hearing and they had to come see for themselves.Buy this at your own risk. Just know you can never work while your significant other or baby is sleeping, and all of your neighbors will know when you're typing an e-mail.",
    4.0
  ],
  [
    "Bobby",
    "Not bad at all. Just not what I was looking for.",
    "I ordered this keyboard and a Redragon K565 mechanical keyboard at the same time. The prices were close with a coupon but without one the Redragon was more expensive.I tested both out and while there was nothing physically wrong with the Black Shark keyboard it definitely lacked some of the features the Redragon K565 comes with.As an example:  The Redragon K565 has software you can download to customize your LED colors for each key using HTML color values (red, green, and blue combinations) which makes things quite easy to setup while offering an endless variation of colors.  The Black Shark keyboard has no software to install to make your life easier. Instead, you need to click some buttons while holding the Function key in order to get it in the correct mode and then you need to click each key multiple times to cycle through the 8 preset colors they have programmed into the keyboard to set each one, and with 104 keys on the keyboard it is NOT a quick task.My main reason for returning this item was because I could not set custom colors for my LEDs but had to use their 8 preset colors instead. I wanted a keyboard that was fully customizable and unfortunately this did not fit the bill for me.This is not to say the keyboard is bad. Quite the opposite. Considering the price, build quality, and features it is a great mechanical keyboard for the money. So, if you want something reasonably priced with blue switches, 8 preset LED colors, and an LED around the board itself that you can change the color of, then I highly recommend you buy this item.",
    4.0
  ],
  [
    "John Kesl",
    "Sleeper hit.",
    "This thing is spectacular. The RGB can be adjusted without an app. The switches are mechanical without the clickitty clack of many mechanicals. It's cheap (inexpensive). I've felt keyboards worse than this that cost 4 times as much. If you can get past the lighting, it's super. That being said. The keys are back lit and the color can be made pretty muted and dim, on that front it's one of the best backlit keyboards I've used. I bought it specifically for typing while in a dark auditorium.",
    5.0
  ],
  [
    "Alexander Ray",
    "reliable keyboard",
    "Have had this keyboard for around 6 months now, still works perfectly. It has an app for Windows to run the RGB, I'm sure you could figure out how to sync that with your other RGB software if you wanted.",
    5.0
  ],
  [
    "V.Raj",
    "I really love this keyboard, but the company does not support their product at all",
    "Unfortunately, I had to dock stars because the company doesn't support their product. My keyboard's base light - the one that goes around the bottom and makes the shiny metal look all fancy - stopped working about a month after I bought it. I contacted the company immediately and they never even responded. I contacted them again about a month later, to give them a second chance. Again, I didn't hear back from them.The size of the keyboard is good: it's not as bulky as other gaming keyboards so it's easy to push out the way when my chonk of a cat wants to take over my desk. The red switches feel great and, while I sometimes experience some issues with keys hitting too easily, I think that's a better problem to have than it taking too much pressure to activate. The software works, although it doesn't do much (see the link in the product description beneath the bullet points). The lighting (other than the base light) appears to be consistent and the patterns are nice (I like the outward pattern - full color- at a medium speed). It does not appear to have per-key individual light settings. The function keys work well, although they can be hard to keep track of. Fn-Win is a lifesaver when playing Overwatch 2. I am using aftermarket keycaps on my keyboard (they're the XVX pudding double-shot PBT in OEM profile). They work perfectly and look amazing, but I have no idea what the rest of the function buttons are/do because these are generic.I hate to dock stars on this keyboard because it's a great deal and it really does seem to be decent quality for the price, but lack of customer support is a huge no-no for me and it prevents me from being a repeat customer.",
    3.0
  ],
  [
    "Draco",
    "I am Man. Hear me type. LOL",
    "Although this keyboard is meant for gaming, I actually use it at work, because I need a good lighted keyboard that doesn't require a driver to control the lighting effects. I also prefer the clicky and tactile keys, which this keyboard offers as one of its options. The clicking sound is very satisfying to me. When my managers hear me typing, they know I'm working hard and earning more profit for the company unlike some of my lazy coworkers. Yes, these lazy coworkers are irritated by the clicking sounds, but it is more because the clicking sounds make the managers more aware of the laziness of these coworkers. If you want more satisfaction at work or trying to get your lazy coworkers to actually work, you should use this keyboard. LOL.",
    5.0
  ],
  [
    "RFM",
    "Good Keyboard for a Modest Price",
    "This has the best switches for gaming and you can choose between the blue & the red touch types as you prefer. For some reason though the charge $2.60 more for the red type. In case you are not aware here is a reprint from \"Tom's Hardware\" site explaining the different switch types:==========================Cherry MX Reds are some of the most widespread switches out there, and for good reason. These linear switches require 45 grams of force to actuate. The light touch makes them a good choice for both gaming and typing. The keys are also very quiet, particularly the MX Red Silent variant, which makes them good for office environments or crowded houses.Cherry MX Blacks are linear switches that are very similar to Reds, save that they require 60 g of force to actuate. They feel a little more resistant than Reds, and are also available in a Silent variant.Cherry MX Browns are some of the most popular switches in gaming keyboards. Browns are tactile switches that require 45 g of force to activate. They don't make much sound, and spring back very quickly after actuation.Cherry MX Blues are \"clicky\" switches, meaning they make audible clicking noises every time you depress them, like typewriters of old. Some users find the noise gratifying; others find it insufferable. You won't know until you try. Cherry MX Blues require 50 g of actuation force.Cherry MX Speed or Silver switches are built with gamers in mind. Like Reds, Cherry MX Speeds are linear switches that require 45 g of actuation force. Unlike Reds, though, they travel only 1.2 mm rather than the standard 2 mm. This theoretically lets gamers pound keys faster.=================================So once you decide the type you need you can explore the different keyboards. The most common are the red and blue of this keyboard. For the price you get a high quality keyboard (full size) with the mechanical switches you prefer. Great price for a quality keyboard.",
    5.0
  ],
  [
    "Colin A. Campbell",
    "A few quirks",
    "My sample of the Black Shark Sixgill K2 keyboard has some problems.  First, the app for it does not work.  Does not talk to the keyboard at all.  Every time I install it, it says there is a firmware upgrade but never does  anything about it.  Trying to change any settings in the software leads nowhere, does nothing.  Also, the Scroll Lock light does not come on when Scroll Lock is pressed.  Can't tell if Scroll Lock is on or off.  Also, character stamping on the keys is inconsistant.EDIT-I changed iit to 4 stars.  Turns out that what would normaly be the \"scroll lock\" light is the Windows key lock light.  So, that is a feature, not a bug.  It's apparently a gaming thing.  Also, I was able to get the app to work by cancelling the firmware upgrade.  So, the only remaining problem is the firmware upgrade that the app is always suggesting doesn't work and cancelling it is the only way to get the app to work.  No big deal there.  I do love typing on this thing.  My typing accuracy and speed is definately improved over membrane keyboards.  Also, the price is right.",
    4.0
  ],
  [
    "CL",
    "nice keyboard!",
    "I like this keyboard a lot! The light on this keyboard are very nice and there are many different settings to choose from. The keys sound alright. They are not too loud, but the spacebar is particularly thunderous. It also has this strange lingering metallic ping after each press, which is weird. The keys do feel nice to type on, but the keys are very tall and it is very easy to accidently press a wrong key along with the key you pressed. It doesn't take very much of a tap to press down the key, so this happens a lot. Other than that, I am happy about my purchase, and would recommend.",
    4.0
  ],
  [
    "Waldemar Medina",
    "Nice for your first Mechanical Keyboard!",
    "It looks nice on my desk! with the programmable ligths you can choose variety of light animations.  If you are a costume to a normal keyboard, you gonna find thie use of this one a little difficult at first.  But you going to get a costume.",
    4.0
  ],
  [
    "Christopher Vasquez",
    "I would say this keyboard is good for the price.",
    "I been using this keyboard for a little and so far I love it. This is my first ever mechanical keyboard I have ever used. And it does feel more responsive then a membrane.  When I first used the keyboard it felt louder then a membrane for sure. However I am sure you can get used to the sound. The issue really more is it might  be annoying to other people. That's why I don't think you should use it in worl environments. I would also say this is a good entry level mechanical keyboard. The key switches are solders on to pads. So you still have to unsolider them to replace the key switches. If you can I would recommend buying ones with hot swapble keyboard switches.",
    5.0
  ],
  [
    "Alain Poncelet",
    "Really happy with this keyboard.",
    "I haven’t used a mechanical keyboard for years, so, it was fun to come back to it.This keyboard is really nice, the keys are very crisp and the feeling is great.It looks absolutely gorgeous and very solid. The frame is metal which looks super durable and the light functions are superb.The packaging was very solid and protected the keyboard perfectly.Overall, it makes it super easy to use and it seems like it’s gonna be durable and last forever.The 4 stars on gaming is only because I’m not a gamer but I’m sure it would perform great in that role too.Top notch keyboard.",
    5.0
  ],
  [
    "Elbert Buchanan",
    "Very good budget keyboard",
    "I like this keyboard. Since I do not game using a keyboard, I cannot speak to it gaming prowess. However, I use it as a standard keyboard and I like it in that use case.The keys feel good and have a pretty loud click. For basic use, it is loud and off putting but gamers seem to love that. There are different RBG modes and gaming layouts. You can switch modes pretty easily. Programming the keys is a bit cumbersome. To have a single color backlight, you have to program each key individually. I downloaded the software for the keyboard found on the product's page. I've only tried to use it to customize the colors but cannot figure out how it do it properly.Overall, I like it and as I get back into gaming, I will eventually use it to its fullest potential.",
    4.0
  ],
  [
    "Nils Lorvick",
    "It's an Okay Keyboard",
    "I will say, the looks of this keyboard in the dark is very striking. The edge lighting around the base does give it a very cool vibe. The typing sound though leave a lot to be desired. The keystrokes are very hollow sounding when bottoming out, it becomes annoying very quickly. I've typed on other blue-switch style keyboards, and the sound wasn't nearly as annoying. For $39, not a bad starter mechanical keyboard, although I think for $5 more you'll be much happier with the Red Dragon K556.",
    4.0
  ],
  [
    "MamaBooty71 ",
    "Great for work",
    "I am not a gamer but work at the computer for long hours. Spending that much of my life at a desk, I am, worth the investment to have a good keyboard to make me more efficient and as weird as it sounds, enjoy typing. I have a dual computer set up. My first computer has a razor keyboard. The quality  on this is not premium like the razor, but it is good a good value for the price point and a million times better than the standard hp keyboard. Mechanical keys are always louder, but the springiness provides a tactile quality that springs up my work productivity.  The keyboard keys are standard size and width, but the casing itself is minimized, so it is a full keyboard with numeric pad but takes up a lot less space on my desk. Recommended",
    4.0
  ],
  [
    "Pamela",
    "Fantastic budget keyboard",
    "I wasn't expecting much at this price-point, but I was in a pinch for a keyboard to use for both work and gaming. This keyboard is outstanding tho. The top-plate is metal, the back is plastic but because the top plate is metal the whole thing is really rigid. the keys don't feel mushy at all, and the rgb options are nice. Some subtle, some flashy.My only complaint is that is doesn't come with a wrist wrest but at this price point its probably better they leave it out to maintain the quality of the board.",
    4.0
  ],
  [
    "Nate",
    "First mechanical keyboard",
    "Bought this to see how well I'd like a mechanical keyboard, figured it seemed like a nice one for the price, I'm happy enough with the purchase that I'll keep the company in mind if I want a new mouse or anything.",
    4.0
  ],
  [
    "Alex",
    "Love this keyboard",
    "The media could not be loaded.\n                \n\n\n\n Been using this keyboard for sometime now. Love the feel and sound it makes, but it is loud if you’re in an office or have roommates. Colors can easily be changed, and has a nice heavy feel too it. Good packaging. Happy with purchase.",
    5.0
  ],
  [
    "Anthony Piedimonte",
    "Feels great sounds great looks great",
    "What’s not to like for the price? It’s a 10 key keyboard without all the unnecessary trim. Good weight. RGB color options are nice and the keys sound great to me! Not too loud but still clicky.",
    5.0
  ],
  [
    "Mathew Crogan",
    "Sticky Key(s) - UPDATED",
    "THIS REVIEW IS TEMPORARY AND WILL BE REMOVED IF RESOLVED.They keyboard overall seems quite nice but I just got the keyboard last night, took it out of the box, and discovered my left shift key (my second most used key on the keyboard) is sticky and dull. It provides no feedback when clicked and does not always register the click. I have tried removing the key and cleaning the slot and the key itself to no avail.Overall, this keyboard honestly seems wonderful as the rest of the keys provide wonderful tactile feedback and the RGB lighting is quite enjoyable. However, you need to get all 104 keys right or the keyboard just feels off, especially when it's as important as the shift key. As a business owner myself, I know things like this just happen, no one's fault in particular. If we are able to get this resolved (as it's likely just an unlucky order), I would give this product 5 stars. I had no way of reaching out to the seller directly hence while I left the review here.=================UPDATE: My keyboard has been replaced and is worked as expected. Thank you!",
    5.0
  ],
  [
    "Mr. J.V.Z",
    "Love this keyboard.. Simple, well built with good materials and pretty lights (RGB)",
    "The pictures really don't do this thing justice until you actually pull it out of the box and plug it in. It's nice sleek aluminum body feels extremely well built and has wrap around RGB trim along with the keys. It's simple and sturdy and just what I was looking for. Plus it's a very reasonable price for what you are getting.",
    5.0
  ],
  [
    "shenson",
    "the keys does not work at a certain time, would like a refund",
    "Cheap mechanical keyboards are often made with lower-quality materials and components, and the manufacturing process may be rushed or not held to the same standard as higher-end keyboards. This can lead to defects in the keyboard, such as faulty switches or broken solder joints, which can cause keys to stop working.Secondly, another common reason why some keys may not work on a cheap mechanical keyboard is due to wear and tear. Mechanical keyboards have individual switches for each key, which means that each key can be replaced if it becomes worn out or damaged. However, cheap mechanical keyboards may use switches that are not as durable as those found in higher-end keyboards, leading to a shorter lifespan for the keyboard. Over time, this can lead to some keys becoming unresponsive or failing to register input.Thirdly, another possible reason why some keys may not work on a cheap mechanical keyboard is due to poor maintenance or cleaning. Dust, debris, and other particles can accumulate inside the keyboard over time, which can interfere with the function of the switches and cause keys to stop working. This can be exacerbated if the user frequently eats or drinks near the keyboard, as spills or crumbs can get inside the switches and cause damage.In conclusion, there are several reasons why some keys may not work on a cheap mechanical keyboard. These include poor quality control during manufacturing, lower-quality components that are more prone to wear and tear, and poor maintenance or cleaning habits. While cheap mechanical keyboards may be an attractive option for those on a budget, it's important to keep in mind that they may not offer the same level of durability and reliability as higher-end keyboards. As with any product, it's important to do your research and invest in a keyboard that meets your needs and expectations.",
    1.0
  ],
  [
    "John Nguyen",
    "Amazing RGB and key switches for 30% retail cost",
    "This keyboard blew me out of the water. I had a Redragon K552 Surara which was an amazing keyboard at its price point. I even bought a TKL version of the redragon, but let me tell you when I say, I WISH I found this keyboard first.The craftsmanship of the actual product is so nice, there is an aluminum-style backplate that keeps dust out, and the rgb... AMAZING. In addition to your standard lighting, there is an led strip around the whole keyboard and it looks absolutely stunning, especially when it was a nice surprise. $40 is definitely a steal for this keyboard: I would be comfortable paying $60 for this, as it is of very high quality. Definitely a huge thumbs up from me to Black Shark. Buy this keyboard, do it!",
    5.0
  ],
  [
    "M Sullivan",
    "It works great!",
    "Good keyboard. Had it for a bit now and it's doing the job. The buttons have a nice feel and the LED helps in the dark. Whatever you do though, do not take some mushrooms and look at the keyboard in the dark. Other than that, it's great!",
    5.0
  ],
  [
    "Michael M",
    "Great value.",
    "This is everything I needed.  Good lighting features.  Enough macros to be useful.  Very aesthetically pleasing.",
    5.0
  ],
  [
    "John Goggans",
    "Decent keyboard for the money",
    "I've not had the best luck with keyboards lately so I'm giving these a shot. So far, I've been impressed. They have good weight to keep it in place and you can jazz up the lights just about any way you want. There is a bit of a click when typing which I like. I've only had it a few weeks but, to this point anyway, I'm very happy with it.",
    4.0
  ],
  [
    "MrBaconbit",
    "Nice keyboard",
    "Very smooth and quiet for a mechanical kb. I game on my tv in the living room and I wish I would have thought about the fact this thing is very narrow. I'm used to the big boards that have a lip around the outside to pick up and move around since I'm on teh couch and using coffee table for desk haha. Real hard to just pick it up without pressing a key but that's my bad. The kb is super responsive almost to a fault. I had to retrain my fingers because the lightest touch sets them off which is a good thing. Lots of settings for the lights which is nice and feels well built. Well worth the money!",
    5.0
  ],
  [
    "Sean Humphrey",
    "Well Worth The Money",
    "Let me start off by saying that I am not one to spend hundreds on a gaming keyboard. When I saw this mechanical keyboard for less than $50, I could not pass it up.It sounds and feels very smooth when typing. You do not have to push hard at all on the buttons as they seem to just glide down with ease. Been using it for all my gaming and just love how it sounds, looks, and feels.10/10 would recommend.",
    5.0
  ],
  [
    "StormTrackerJay2",
    "Good mechanical lit up keyboard",
    "Basically it does what it is suppose to do. It's a computer keyboard that lights up. I prefer mechanical keyboards much more than those quiet types of keyboards.....just how I am. Keyboard is super good and works for me quite well and love the lit up keyboard for darker room usages. Excellent keyboard, 5 stars.",
    5.0
  ],
  [
    "Tony",
    "Very happy with this keyboard",
    "I needed a keyboard with a backlight and some feet. This has more than I need. It's very satisfying to type on. Seems like a great value with a solid premium feel. No need to mess with batteries. I guess time will tell if it lasts. I have high hopes.",
    5.0
  ],
  [
    "Kevin",
    "The nicest gaming keyboard!",
    "I loved the keyboard, great value for your money! It looks and it feels nice.",
    5.0
  ],
  [
    "Denise M. Bosmans",
    "Great mechanical keyboard - does not require software for basic features.",
    "Price is awesome, lighting effects are easy to use, and you don't need to install any software, like some other mechanical keyboards (that starts with a R@xxx) - I bought this to replace my old keyboard that just stopped working for no apparent reason. Nice and clicky, good response, and feels sturdy, plus it looks great. Don't really do any gaming on it though, but I am sure it would be great for that too.",
    5.0
  ],
  [
    "dinobizzot",
    "Awesome",
    "The keyboard is great, only complaint is that my number 2 key is not working the best. Other than that, great options for customizing and the clacking sound never gets old.",
    4.0
  ],
  [
    "Susan Adams",
    "Love this keyboard and I am not a gamer",
    "I am 75 years old and learned to type in high school using a manual typewriter.  I never got used to using those flat keys. My husband ordered one for me and it was just perfect.  I don't mind the colors, they are pretty. I had another one but spilled my coffee on it... the price is very manageable.",
    5.0
  ],
  [
    "J. Garrett",
    "So great for the money and to avoid the rabbit hole...",
    "As I type this, I hear the satisfying clack click clack of these keys. If you want an easy introduction into the world of custom clicky keyboards, you would could do much worse as a starting point. I am sure there are much better, but very happy with this as a starting point.",
    5.0
  ],
  [
    "Denis Ty",
    "good value, nice RGB and solid build, but keys have inconsistent responsiveness.",
    "my 1st mechanical kb. black shark red linear switch has a good feel. there is an abrupt stop at the end of stroke, compared to mushy soft-feel membrane keyboard.the keyboard I got had a defective \"H\" keys it does not register when pressed.  I had to disassemble the keyboard, some screws use #6 torx security bit. had to desolder the defective switch and replace it.also keys are very sensitive.  slight press and it will auto repeat.build is solid, and selectable RGB lights are nice.good for gaming and casual typing.  not ideal for touch typists or e-sports.tip: download the BS-K2 configuration software for best results.",
    3.0
  ],
  [
    "Jefrey Altan",
    "It’s great",
    "I liked the way it sounded and how it felt nice",
    5.0
  ],
  [
    "Shuz",
    "Good keyboard",
    "For a $40 keyboard I am very impressed. I use it for work so not much gaming, but it’s still been great!",
    4.0
  ],
  [
    "MrMiSa",
    "El diseño",
    "The media could not be loaded.\n                \n\n\n\n Es una excelente opción de compra, bastante económico y buenos materiales de construcción, aunque solo se cambian los keycaps, pero aún así muy buena diversidad en el RGB.",
    5.0
  ],
  ["pedro luis cruz", "good choice for me", "", 5.0],
  [
    "Ed",
    "\"T\" key doesn't work",
    "\"T\" key doesn' work, which is such a small problem but it makes the keyboard unusable. i tried taking i apart and cleaning it, which helped but did not fully fix it. This was broken out of the box, so i cant recommend.",
    2.0
  ],
  [
    "RAD319",
    "OK but no customer support?",
    "I bought this because I wanted \"clicky\" RGB keys.  I downloaded the setup app and after some time, figured out how to configure the lighting for my use.The app gives a clickable link in 2 places to update the software, but clicking either link does nothing.  Searching for some sort of customer support reveals nothing except a web page that contains links to the same software that says it needs an update.But the keyboard works.",
    3.0
  ],
  [
    "Aaron B",
    "Good value rgb",
    "Inexpensive RGB keyboard, not a huge gamer here but matched my Strix laptop and rgb setup nicely. Nice clickity keys.",
    4.0
  ],
  ["Jason Barks", "Great keyboard but very loud", "Title says it all.", 4.0],
  [
    "Mark E. Istvan",
    "Good solid keyboard for the money",
    "I use this keyboard daily for software developmentLike ability to adjust look and feel without 3rd party software which works great in my employers controlled envuronment",
    5.0
  ],
  [
    "meydan",
    "Excellent value for money",
    "I did not expect much from this before buying it but it exceeded my expectations.its aluminum chassis gives it a very nice and sturdy feel.the key strokes are pleasant to the ears and overall this is an excellent keyboard.",
    5.0
  ],
  [
    "Alejandra",
    "Casi Perfecto",
    "Solo le faltaría que hiciera menos ruido 🤭",
    5.0
  ],
  [
    "Not Steve",
    "Solid for the money",
    "Bought for around $35 would recommend for the money.",
    5.0
  ],
  ["Vlado", "Good quality and great looks!", "Excellent value fir money", 5.0],
  [
    "Felipe",
    "Can't expect much",
    "It's well built and looks good.  But in a week  could notice a key getting triggered out of the blue.  So don't expect it to be a gamer keyboard.  Just a cheap one.",
    2.0
  ],
  [
    "Justin Emord",
    "Works great",
    "Great keyboard,  I use it for photo editing as I usually work in dimly lit areas and the lights allow me to still see what I'm doing.",
    5.0
  ],
  [
    "Virginia D.",
    "Solid Keyboard",
    "Really like the build quality on this keyboard, keys are nice and loud.",
    5.0
  ],
  [
    "dwight",
    "Well built.",
    "This is a very good keyboard for the price. I use it for work but I believe it would make an excellent gaming keyboard.",
    3.0
  ],
  [
    "Henrry",
    "In love with it",
    "Wonderful keyboard, a little bit noisy, but with mechanical is what we looking for, wandering to buy another one...",
    5.0
  ],
  [
    "JAV",
    "Gorgeous",
    "Best looking kb I have seen. At this price, its a no brainer.",
    5.0
  ],
  ["Bau", "The keys feels great", "Way better than my last keyboard", 5.0],
  [
    "Jimmy ",
    "Looks good does not work with OpenRGB",
    "The media could not be loaded.\n                \n\n\n\n Can't control lights in Linux",
    5.0
  ],
  [
    "Edwin Marcelo",
    "Buena inversión",
    "Buen teclado, lo recomiendo mucho",
    5.0
  ],
  [
    "Zodiac Sam",
    "Louder than a kindergarten classroom.",
    "I bought one.  It's a piece of crap.  LOUD LOUD  Rattles something awful.  Keys are loose and flimsy.  Light bleed is bright like the Las Vegas Strip.  Junk, all junk.",
    2.0
  ],
  [
    "Jarod",
    "Functional and fun to look at",
    "Very functional and customizable color",
    5.0
  ],
  [
    "Nino Mikava",
    "thats crazy keyboard 10/100",
    "thats crazy keyboard 10/10 seller",
    5.0
  ],
  [
    "CuriousMind",
    "Great for 4 months",
    "Loved this keyboard. Unfortunately I'm at 4 months and my keys are no longer inputting. Sometimes I get no e other times I get 2. Other keys are starting to miss as well. The support website doesn't work so I'm really bummed.Update. Still no word from the company. Now searching for a better brand. Don't want to have to buy a keyboard quarterly. I would not purchase again. Many keys have stop working now.",
    1.0
  ],
  [
    "Jackson Voss",
    "Lasted less than a month",
    "At first keyboard seemed great, within a month clicks are not registering on commonly used keys and keys get stuck after pressing them. You’d be better off spending a little more on a better keyboard that lasts longer than a month.",
    2.0
  ],
  [
    "Arthur Faraday",
    "Worked great until it didn't",
    "After about 4 months of light use, this keyboard experienced an issue where the lights flash and it inputs random keystrokes, rendering it unusable. It's a shame, because it's otherwise a nice keyboard.",
    2.0
  ],
  [
    "Michael Flood",
    "Broke After Two Months",
    "This keyboard was ok, it sounds a little cheap and echos a lot when typing, but was ok. Then about 2 months after purchase the space bar just stopped working. I should have returned it when I thought it sounded cheap.",
    1.0
  ],
  [
    "Jonas",
    "Frequently fails to recognize input",
    "I've frequently experienced missed keystrokes on this keyboard starting shortly after purchase, which i'd never had with any other keyboard in the past. Thought it was just me messing up but no, several keys continuously giving me problems, and the number of keys that are misbehaving appear to be increasing gradually, so I'm unwilling to individually replace keys. Will replace.",
    1.0
  ],
  [
    "Chris DiGiacobbe",
    "Don't Bother",
    "Edit: from 2 stars to 1 star.  Spacebar now decides it only wants to work 1/5 of the time.  *DO NOT BUY*Months later, keys (esp S) decide to either not work or overwork.  I'll be playing a game, trying to backstep using S, and the keyboard ignores the input.  Other times, I'm typing in chat and it decides to hit S multiple times, making me look like a fool.  Other keys also have issues.  Do not buy.",
    1.0
  ],
  [
    "Amazon Customer",
    "Erratic keystrokes while typing",
    "Keyboard is not reliable and acts oddly.  While typing in a URL or comment box the print dialog box will appear or the contents of the box will disappear.  This occurs in every application and is frustrating to use. Do not recommend and suggest buying a different keyboard from another manufacturer.",
    1.0
  ],
  [
    "Tillman",
    "Okay until it stopped working",
    "Not bad for the money, but you get what you paid for. Tried getting support and the link leads to a broken website. Wouldn’t recommend.",
    1.0
  ],
  [
    "Charles Cone",
    "Key switch failed in 2 months.",
    "Lost the D key to intermittent switch failure in under 2 months.  Unfortunately you get what you pay for with mech keyboards. Avoid this one.",
    1.0
  ],
  [
    "Simon Balkaran",
    "You can't go wrong here, simply worth it.",
    "I bought the red switch version, and have been using it daily for 3 months as of writing this review. The material is definitely quality, no cheap plastic around. Keys feel nice and smooth, frame is slick and quality metal. It's a bit hefty, you can tell this isn't some cheap build by just picking it up. The RGB is amazing. Great patterns and colors. Haven't downloaded the software to get the full RGB experience, but if you're just using this for casual gaming/intensive typing like I am, then you'll have more than enough presets and colors. Keys aren't showing any type of fading, but I suppose that has to do with the amount of natural oils on your fingers.Functionality:The keys are VERY responsive, and the no-resistance feel of the red switches is great. Not too noisy, but a decent amount of clicking. Comes with a keycap-puller, which is pretty convenient. Tons of function keys that are useful, including volume, media interactions, and other app shortcuts.Cons:When my keyboard first arrived, the \"-\" key was only working when pressed at a certain angle but is working just fine now. The \"Scroll Lock\" key doesn't work, but honestly not much of a bother to me personally. On very rare occasion, the RGB will randomly turn on even when the PC is off. Just a couple things to keep in mind, but overall a really great product. Love it.",
    5.0
  ],
  [
    "Larry Musgrave",
    "My 17 year old gamer son has been using for 10 months.",
    "My son has been using this mechanical keyboard for almost a year now and he is satisfied with it. He builds his PC by buying individual parts and sells/upgrades as newer and better items come out or drop into his desired price range. This keyboard has satisfied his needs for almost a year and I do not know of him desiring anything to replace this. Based on that, I am going to say that you are good to go! Sorry, I am not a gamer myself and only use a laptop PC, so this higher end stuff means nothing to me. But he is the kind of guy who thinks little of spending a grand on a graphics card and sell off his \"old\" one for $700. I just do not get these kids. But hey, he works and does his thing.",
    5.0
  ],
  [
    "George Schmidt",
    "Phenomenal Value",
    "For the price, this is absolutely unbeatable. The brushed metal faceplate feels very premium and the clicky switches feel identical (to me at least) to $100+ keyboards. The built-in lighting effects are numerous and were more than enough for me. I've had this keyboard for 3 months now and I'm very satisfied.",
    5.0
  ],
  [
    "Nick Vendura",
    "Great for the price, but has an odd noise",
    "This Black Shark RGB mechanical keyboard has some pretty great features and qualities for its price point. However, there also are some pretty annoying aspects/oversights that keep this from being an overall great keyboard. Let me try to break it down point by point:THE GOOD-Great build quality for price. The aluminum base is strong and prevents any chance of flex. the keys caps have a smoothness that I've not even felt in some very high-quality/expensive keyboards.-LEDs are bright-The switches themselves are clicky and responsive. The noise is another issue (See \"Not So Good\" below)-Many LED options: There are, of course, LEDs under the keys, but there is also an LED strip that goes around the keyboard as well, though it has very few lighting options-Manual is easy to understand and clearly written.THE NOT-SO-GOOD-Noise. OK, I saw a few reviewers stating that these keys are noisy, and I was thinking to myself, \"Well, they're clicky, of course they are.\" Nope. That's not it. It's difficult to describe, but there is a discernible \"echo\" with these keys, apparently it's known as \"Spring Ping.\" The click itself is quite tame, even quieter than many other blue switch brands, it's the release that is noisy. It makes a very odd, metallic sound that lingers and then fades for about 1-2 seconds after every single keystroke. The harder you type, the louder and longer it is. It's quite annoying and like nothing I've ever heard from a blue switch (or any color) keyboard before. Here's the best analogy I can give: It sounds exactly like someone is banging on a metal drain pipe two floors above your apartment. It has that distinctive sound, but it's not extremely loud. This is the fourth \"clicky\" blue-switch mechanical keyboard I've owned and the only one to have such a loud echo/ping.-No USB/Power option: The USB cord is physically attached to the keyboard, which I guess is fine for a budget keyboard, but I would like the ability to turn the keyboard off when not in use so that I don't brush against it or my cat doesn't walk across it. To prevent any unintended keystrokes when not in use, you MUST disconnect the USB cable every time.-No solid colors. There are 12 standard lighting configurations and five gaming modes, but none of these have an option for a solid red, white, etc. background, which is quite disappointing. I like the rainbow effects, but I prefer a solid color when I'm working, and this is NOT an option with this keyboard.Overall, this is a very nice keyboard, and for the price, it's exceeds expectations. However, the unnerving echo from typing coupled with the few other lacking features means I just can't give it a full five stars. I'll be honest, it's pretty close, and if it weren't for the echo noise, I would definitely give this a full five-star rating. As it is, it's still a nice option and a great value that I have no problem recommending. It just cannot be my daily driver.",
    4.0
  ],
  [
    "Matsu",
    "good overall",
    "i really like the keyboard even if idk how to change the rgb lights, idk if my fingers are too big but sometimes i activate more keys that i want when im playing anything maybe i just need to get use to the keyboard, i like type on it feels good even if you can  hear the click from the keys your mic wont detect that sound and other people says is there but isn't annoying, the keyboards can resist some falls without dmg but in general if isn't an accident please be good with your keyboard and others",
    5.0
  ],
  [
    "DGEntertainment808",
    "Full size mechanical keyboard with software controllable RGB",
    "If you are looking for an RGB keyboard that you can control with software, this is a great option. The software is not super high end. Not sure if you can get another app to work with it. My MSI Mystic Lighting software did not detect it, but not much is compatible with that software.The RGB has built in lighting effects directly controllable on the keyboard or via the software. The keyboard caps do give hints which buttons to use for the lighting effects and the instructions go more in depth.The software gives options for macro key set up, gaming modes and lighting effect controls. No drivers or software were included with the keyboard. The instructions that were included also did not tell you where to locate the software. I managed to locate the URL for the drivers in the description. The website that contains the drivers looks questionable and I did have some issues accessing it at first.Gamers can take advantage of special lighting effects. The correct lighting mode will allow you to highlight gaming related keys and will keeping other keys unlit.Personally, I really appreciate the surrounding RGB on the outside bottom of the keyboard. It highlights the keyboard and makes it stand out. The lighting is also bright enough that you can see it without issues day or night. The brightness can be adjusted through the keyboard macros or via the software. The outer lighting effects are controllable interdependently from the main keyboard lighting to allow for dual effects.The keyboard is mechanical, therefore you hear your typing. If you are looking for a keyboard that gives you this effect, it's nice and loud. The keys have a  good amount of sensitivity, very responsive. The keys are not hard to press and do not feel spongy. Just like with any keyboard, there is a slight learning curve and I have and to adjust and adapt my typing to match. The height of the keys are slightly taller than my previous keyboard. I do find myself accidentally pressing the control or shift button with my left hand. Something I am learning to work with.The caps are also removable very easily. The keyboard I received had the “Ins” key sideways. It was very easy to remove the cap and re-seat in the correct orientation.The bottom does contain rubber pads to reduce unwanted movement. The keyboard can also be propped up in the back like most keyboards. The kickstands are also rubberized to help keep the keyboard in place. The keyboard also keeps a minimalist feel by not having a lot of wasted material around the edges. Much appreciated!The build is very solid. Tried to put a little pressure in various locations with my hands to see if it would bend or flex in any way. Saw very minimal stress for the amount of pressure I was putting on it. Of course there are limits and I was not trying to be super forceful.Overall, very satisfied with the keyboard.",
    5.0
  ],
  [
    "Gage Bond",
    "Was amazing until issues started",
    "I loved this keyboard for the first 4 or 5 weeks I had it. It was as good or better than $150+ mechanical keyboards I have bought in the past. However, this week it has started having an issue where the key of the top row of letters (Q through P) will start spamming random character when you press one of those keys, while the rest of the keys work normally so it is basically unusable. I don't know if there are hidden dipswitches or a key combo I need to hold to hard reset it, as trying to reinstall drivers and Windows does nothing thus far. Really disappointed.",
    3.0
  ],
  [
    "Christopher Pike",
    "Solid budget minded mechanical keyboard with really neat lighting effects",
    "This keyboard surprised me.  I wasn't expecting it to be very good for the price point, but I honestly really like it. I have previously owned a couple different name brands of higher end mechanical keyboards, and I used one of them exclusively for several years when I was really into my computer gaming days.  This Black Shark RGB is very similar to those, although it uses Blue Switches.  I was used to typing on Cherry MX Reds.  There's a slightly different feel.  It's still very clicky with a loud switch sound with each keypress.  It doesn't feel quite as tactical as the Red Switches.Overall, the typing experience is nice.  Right out of the box I ran a typing speed test and it came out to 67wpm with 89% accuracy.  That's not bad considering I'm in no way used to this keyboard yet.  I'm sure that rating would improve to my usual 80-90wpm range after some time with it.Now on to the fun part.  This keyboards RGB really shines (pun!) and it's a lot of fun to tinker with all the different lighting modes.  Right out of the box and plugged in there is a nice rainbow effect that slowly slides from left to right, sort of like seeing \"the wave\" at a ball game.  By pressing the function + print screen buttons you can start to go through various light effect modes, all of which are pretty neat.  Even the bottom edge of the keyboard base itself contains RBG lighting, which I wasn't expecting, but is really cool!One major benefit to this keyboard is that it's truly plug and play.  There's no waiting on proprietary software/bloat to install on your PC.  I checked my programs list in the control panel and could not identify anything that had installed.  This is great!  I don't care for that extra stuff.  Props to Black Shark for not forcing us to install third party software.  For this price point this keyboard certainly deserves a perfect rating!",
    5.0
  ],
  [
    "KJN",
    "Very Solid",
    "If you don't like noisy keyboards, don't order this keyboard. It has blue switches, which are designed to provide an audible click when actuated. I don't find the noise level to be objectionable, but some may. Black Shark doesn't specify what company supplies the switches, so they are probably not from the premiere switch suppliers like Cherry, but hopefully they will hold up. The price is reflective of an off-brand switch supplier. The switch actuation feels like a typical mechanical keyboard, but with perhaps a bit less pressure to actuate the switches. The keyboard itself is heavy and robust, made with some fairly thick aluminum. The rear feet feel very solid when deployed, and they have rubber covers to prevent sliding. The keyboard doesn't come with a wrist rest, so I'm using one that I owned previously. I received the 104 key version, although the manual alludes to a 105 key version also available. The keyboard is pretty basic, without any extra addressable function keys or rheostats for volume control. The keys have clear designations for letters, numbers, and symbols, but they are a bit hard to read if the backlighting is off. Speaking of backlighting, there are 12 built-in lighting modes that can be selected either by key combinations as listed in the manual or by the available software that can be downloaded from Black Shark's web site (global.blackshark.com/pages/downloads). The software is reasonably user friendly, and will allow some pretty sophisticated settings, but I'm a simple guy and am OK with the default initial lighting setting. I like the look, feel, and functionality of this keyboard, but understand that the clicky noise isn't for everyone.",
    5.0
  ],
  [
    "Kalepa",
    "Software not compatible on Mac, keys are a bit loud, but otherwise a solid keyboard for the price",
    "Overall this is a solid keyboard! Only two small issues to complain about:The key presses are fairly loud, even compared to other blue switch keyboards I own. It's mainly the pitch, which I assume is from the key cap material hitting the aluminum board. I'm going to try swapping the key caps to see if this solves the issue.The other issue is that the RGB software is not compatible with Mac OS. This is mainly my fault for not checking the download page ahead of time, but it would be really nice if they could update the product page to mention this. Thankfully, some FN + <key> combos allow you to cycle through some built-in RGB patterns, however, for someone who prefers to set multiple effects/custom key colors/patterns etc, it's a pretty big let-down.Aside from that, this keyboard feels really comfortable to type on. Speed tests are hitting ~110 wpm which is on the high-end for me. It's definitely an upgrade from the mesh-style keyboard I was using prior.",
    4.0
  ],
  [
    "Amazon Customer",
    "Faulty Switch",
    "The packaging was nice, but it was damaged when received with holes poking through the box.Thankfully it didn't poke through the keyboard...Lighting effects are great for a keyboard at this price! Different modes with just onboard toggles.There's also the nice lighting on the side, very slick. Though it required a bit of trial and error to get it to stay on one colour.Requires an app for individual key lighting of course. But it was easily installed and set up.The red switch actuator is definitely not Cherry MX Red. It required way too little force to actuate.When testing the keyboard everything was fine, until I hopped on a game and the D key wouldn't register unless it was held down with a bit of force. Immediately returned. Amazon was helpful with the refund and everything.It could just be bad luck or poor switches. - 2 stars overall",
    2.0
  ],
  [
    "Shaun H20",
    "A really nice value keyboard, looks awesome too",
    "I really like this keyboard and it is really nice, a really good value, especially the RGB and how you can make the keyboard look.  I used this for a couple of weeks, very little typos, yes it's fairly loud, people are going to have to deal with it if they're around.  The RGB is plentiful with a lot of effects without using any software which is always preferable.  HIGHLY RECOMMENDED",
    5.0
  ],
  [
    "El Dorito",
    "Keys not working",
    "The feel of the keyboard is great, the keys are weightless but upon my first buy the D key would only work about 20 percent of the time and the second time afte I was sent a new one, the A key has begun to quit working after about 2 weeks.",
    2.0
  ],
  [
    "Spikeypup",
    "Nice solid keyboard with clicky blue switches!",
    "This is a nice run of the mill keyboard that anyone will be happy with if you like blue switches and the loud  tactile click they provide, if you need something quieter try brown or red switches instead, this will be too annoying for you, the blue one.",
    5.0
  ],
  [
    "samiam",
    "Good Keyboard",
    "The keys are loud and clicky just like blue switches are normally, but these are even louder. My other blue switched keyboard is significantly quieter though still loud. The key caps have a nice feeling and are not too cheap. The RGB is extremely bright and if left on in your bedroom will disturb your sleep. The RGB customization is mediocre at best. No software, just some weird button presses. You also only get a few colors to choose from. Also the rgb strip at the bottom of the keyboard does not change.4/5 nice keyboard but would not recommended because of RGB",
    4.0
  ],
  [
    "Hpr1993",
    "Very nice keyboard but also very loud",
    "Very nice keyboard. High quality aluminum body, nice finish and all the keys work well. Keys are obviously swappable. I love the look of this board, and the customizable RGB is great. Overall I highly highly recommend this keyboard. The only compliant I have is that it is VERY loud. If you are in a room with other people or plan on doing a lot of typing, I would recommend against it. However for gaming or else using in a private room it’s not bad. I use mine for CAD work in a large office space I share with one other coworker whose desk is 30 feet from mine (very large office) and if I have to type an email I get some dirty looks. However, many people have complimented this keyboard and several have even ordered their own after inspecting mine, especially considering the price",
    5.0
  ],
  [
    "pmoy",
    "Looks great and works well.",
    "This mechanical keyboard came nicely packaged in a foam-padded box with an easy-to-follow user manual.  The LEDs are bright, look sharp, and are easily customizable following the instructions provided. You can choose the color of each individual key as well as color of the light strip on the base of the keyboard. There are also preset modes that light up only the keys needed for specific gaming styles. In addition, the lights can be turned off altogether. There is minimum (but adequate) spacing between keys and around the keyboard perimeter, which makes the design compact and space-efficient. With the legs on the back deployed, the slant is perfect for maximum comfort while typing.  Finally, there’s the clicking sound when the keys are pressed, which is something I look for when buying a mechanical keyboard.Overall, I think this is a great mechanical LED keyboard for gaming.",
    5.0
  ],
  [
    "Marti1337",
    "Solid affordable mechanical.",
    "You get a lot of keyboard for the price on this one.  Nice, clicky blue switches.  Rigid metal face plate that adds a nice heft to the board, but not so much so that it feels like a brick.  Bright RGB on the keys and around the bottom of the keyboard.  It got programmable macros if that's your thing, and there are also risers on the bottom to adjust the height.  I got mine when they were offering a 40% coupon and it's an absolute steal for 28 bucks, but I wouldn't hesitate to pick one up again at the regular $47 price point.Only downsides are that it doesn't appear to be hot swappable and the keycaps left a little to be desired.  I ended up swapping mine our for some HyperX puddings and its a solid 10/10 keyboard now.",
    5.0
  ],
  [
    "Carlos Pena",
    "Full size and great bright RGB, sounds a little tinny sometimes.",
    "The media could not be loaded.\n                \n\n\n\n After running this at my job for 3 weeks, I really like the way it feels and how it lights up. It has great key travel and response. The back lighting is incredible, especially the RGB strip around the entire perimeter. For the price it is a good value especially since it is a full keyboard.Hope this Helps!",
    5.0
  ],
  [
    "Nikki",
    "Awesome and Perfect",
    "Perfect for low-light gaming or working. Can be adjusted for tons of different color variations, which can match your rig design easily. The keys are very responsive and a little noisy if in the office or common room. I like it either way because it is awesome and adjustable.",
    5.0
  ],
  [
    "Betty",
    "Very cute gaming keyboard",
    "Very cute gaming keyboard. Love the neon lights and the different colors. My 6 year old granddaughter was immediately attracted to the colors and loves it. Since the keyboard lights up, it’s easier to see the keyboard. The keys are easy to use. I would definitely recommend this product because it’s easy to use plus it looks so cute.",
    5.0
  ],
  [
    "D. Porrey",
    "Excellent Quality, Good Sound and Feel, Customizable",
    "This is a quality made keyboard at a good price. The key sound is perfect, and the action is great. There are several color presets for highlighting game keys and an option to customize the lit keys. There are also several colors modes. Overall an excellent keyboard!",
    5.0
  ],
  [
    "J",
    "Excellent keyboard for its price, especially if you've never used mechanical keyboards...",
    "The media could not be loaded.\n                \n\n\n\n The keyboard shipped in its own box shrink wrapped (not inside external box) which was odd, not sure why. Nothing was damaged and the keyboard itself is cushioned well inside the box. Inside the box you get the keyboard, packaging material, manual and keycap puller. None of the items were defective.The keyboard's construction is excellent. It has legs on the back to incline the keyboard up (like most do). It does have drainage holes for spills. The body of the keyboard is incredibly attractive, made of flat pieces of aluminum alloy anodized matte/flat black with chamfered edges (see pic), these are held together with a combination of Torx and Phillips fasteners. Some of the fasteners are under the keycaps and those must be pulled off to access them. Not sure why they didn't go with all Torx or Phillips and used a combination of them instead.One thing I don't like is how the rubber feet on the hind legs of the keyboard can be removed just by pulling. If you slide the keyboard backward on a desk, sometimes they pop off that way. On other keyboards the rubber is usually bonded directly to the plastic with adhesives, through a retention mechanism molded directly into the plastic that requires significant pulling to remove, or ultrasonic welded. If you left this keyboard the feet won't fall off so it's not loose, my beef with it is just that it could be removed by pulling.I do appreciate how there is virtually no room between body and key switches (see pic). The key switches sit higher than the body so this makes it difficult for crumbs or debris to enter the keyboard. Other non-mechanical keyboards use a design where keys are recessed within the body, so crumbs enter the keyboard and sit on the tray under key caps which is annoying to no end. If hair ends up under the key caps here, they look like they have nowhere to go, you can just use a brush to \"comb\" through the gaps between the keys to pull hairs out (or just remove the key caps entirely).The keys use their own \"blue\" switches, not Cherry MX but they're very similar. Very \"clicky\", loud and the feel as you push down is similar (review has a video showing a sample of this). If you like Cherry MX blue you'll like these. If you've never used a mechanical keyboard before, these make typing so much more fun and accurate, it has to be felt to be understood. My fingers glide over it and it makes my typing ability much faster than it already is.The keyboard uses a somewhat standard hotkey/fn layout. You have an fn key and on some key caps the fn alternates are printed on it. The top row (the F(X) keys) alternates with multimedia functionality. F9-F12 are set to things like e-mail, home, calculator and search.Lastly let's discuss RGB. There are two different sections of lighting, the first and obvious is under each key cap. The second is a clear plastic layer sandwiched between the alloy plates that make up the body. Both can be adjusted separately using various fn keys or software, that allow you to do the following:1. Adjust brightness.2. Adjust color (for single-color patterns only).3. Adjust pattern (which includes turning lighting off entirely, if you want either lighting portions totally dark).4. Adjust speed/tempo (yes you can make the patterns go faster or slower).5. For key cap lighting only you can toggle the lights on/off with one key, useful for when you need to turn the lights down to go to sleepFor any configurability above that is bounded by a range with a minimum and maximum (such as brightness or speed), the keyboard will tell you when you've reached the minimum or maximum by blinking all three LEDs for num, caps and scroll lock. This is helpful so that you know when you can't decrease or increase brightness any further.Of the patterns available I categorize these as follows:1. All RGB: Patterns that use all RGB colors by waving through from left to right or rippling them from the center outward.2. Single Color: Patterns that only use one color and either keep them lit solid or pulsating them. When you're in any of these patterns, there's a separate fn key that lets you cycle through color pre-sets.3. Fixed Highlighting: Patterns that highlight some keys with lighting (common gaming keys like WASD) but keep all others off.4. Response-Based: All lighting is off, lighting only occurs in response to a key being pushed. Patterns include lighting up an entire row by moving to the left and right from the key you pushed, ripple lighting keys in an enlarging circle using the key you pushed as origin, or lighting just the key you push and then fading away, so as you type you're leaving a light trail behind (AKA MJ's Billie Jean music video effect LOL).Overall I am in love with this keyboard and though it lacks a wrist wrest which I had on my previous keyboard, the rest of it was so good it replaced the previous Razer keyboard I was using.",
    5.0
  ],
  [
    "Alice Albers",
    "Not worth",
    "Friend has one. Keyboard is nice outside of the lack of braided cable. Plastic standard is just going to grind and ruin your wires overtime. At this price point - the wire should be braided.",
    2.0
  ],
  [
    "Jacquelin G",
    "So bright, so cool, so jazzy",
    "The media could not be loaded.\n                \n\n\n\n I'm not a gamer, I just have work computers and personal computers at home. This keyboard is very loud and clacky, don't use it in a shared office setting. The lights are bright, and the keyboard itself feels sturdy. I love it, it makes working more exciting and engaging for me. The light and sound help me to stay zoned in.",
    5.0
  ],
  [
    "Mandy Bee",
    "Colorful Keyboard",
    "The media could not be loaded.\n                \n\n\n\n Beautifully colored keyboard that is perfect for our gaming room. I really like the variation of light effects. Always enjoy the sound of a mechanical keyboard and the ability to swap out keys if I want to personalize it. Easy to setup and very responsive and sturdy.",
    5.0
  ],
  [
    "Roxanne Levy",
    "Nice keyboard",
    "The media could not be loaded.\n                \n\n\n\n Love the colors and options to change them. The clicking noise is so satisfying.",
    5.0
  ],
  [
    "Brookie",
    "Perfect for my son's gaming computer!",
    "The media could not be loaded.\n                \n\n\n\n My son loves this LED keyboard! It's so pretty. The wave of color is amazing. Just plug and play!",
    5.0
  ],
  [
    "Kayla",
    "Don't trust the non believers!!",
    "I see some comments about the metal pings lol then why get a a mechanical keyboard lmao 🤣 ain't that the whole point I loved the keyboard the moment I heard that ping of the key strokes and its got little weight which suprised me cause typically a budget keyboard is light and feels cheap this is totally worth the money every pinging keystroke feels so exotic in pleasure enducent goodness any keyboard that has that sound needs to be rated in the XXX category on you know what site!",
    5.0
  ],
  [
    "Ap3thy",
    "Very Nice Keyboard",
    "This is a really nice keyboard with really nice RGB lights it is a little loud but it is nice and good for gaming.",
    5.0
  ],
  [
    "JD Power",
    "Clickitty Clack!",
    "The media could not be loaded.\n                \n\n\n\n Love the blue switches because they do the old school click. Had tried several none of which sound as good as this one. It was important I could assign colors to keys and this one does. The software is useless and almost warranted a return, but it's fairly easy to customize the lights pressing certain keys to get what you want. Great buy minus the software.",
    4.0
  ],
  [
    "MrigKash",
    "Set Colour Without Software",
    "Pros:- Colours and patterns can be changed without requiring installation of software on the computer.- Feels premium.- Heavy and stays planted.- Pleasant click sound imparts typing confidence.- Wired, and thus eliminates the need to charge the keyboard.Cons:- Does not come with a wrist rest.- Does not have a USB pass-through.I purchased the Black Shark Sixgill K2 keyboard because I needed illuminated keys in various colours that can be programmed without installing any software on the computer. I set it to constant yellow which I find pleasing to the eyes. I wanted it to be wired, as all illuminated keyboards should be, thus eliminating the need to charge the keyboard or replace batteries. I wanted a mechanical keyboard which confident clicks. This keyboard satisfies all these conditions.It would have been nice to have a USB pass-through and a wrist pad, but for the price, this keyboard is value for money. It has a premium feel to it. It came in a nice box, a key puller, and an instruction manual.So far, I am satisfied with this product.Pictures attached herewith (some partially showing my old Dynex keyboard that has served well over many years).",
    5.0
  ],
  [
    "Sage",
    "Beautiful!",
    "I love how you can change the colors and patterns of colors for the keyboard. The blue switch is very clicky and loud. I use it for gaming and feel that it's decent. It is definitely worth the price because of its quality and beauty! Thank you!",
    5.0
  ],
  [
    "Pedro L.",
    "Muy bueno",
    "The media could not be loaded.\n                \n\n\n\n Muy buen producto",
    5.0
  ],
  [
    "Amazon Customer",
    "I love it",
    "Not to small it is just right and the sounds is emaculate",
    5.0
  ],
  [
    "Ashley",
    "Sounds a bit noisy than I thought",
    "Overall good product, it just sounds a bit noisier than I thought",
    4.0
  ],
  [
    "Alexis Ronaldo Erazo Rivera",
    "Excelente producto mientras no necesites el teclado en español",
    "Un excelente producto, la calidad se siente estupenda al igual que sus funciones, para gaming me parece estupendo",
    5.0
  ],
  ["NoelleJ", "Good value", "Works fine and as expected.", 5.0],
  [
    "Cesar Enrique Beltran Feliz",
    "Excelente",
    "Un excelente teclado por el precio.",
    5.0
  ],
  [
    "Erick ",
    "",
    "Lo unico que lamento un poco es que el viaje es algo largo y al ser interruptores azules son perma clicky aunque de funcionameinto perfecto tiene buenas combinaciones y los efectos del marco de colores le dan un plus excelente  ... pase de un logitech G213 a este definitivamente mejor eleccion que un Eyooso que era mi primera opcion si consideran uno como ese ... por mucho elijan este",
    null
  ],
  [
    "XKALIBUR",
    "",
    "I have a name brand one and this keyboard and I like this one better than the expensive one",
    null
  ],
  [
    "Dale-Ann Ernewein",
    "",
    "I purchased this for my kid as a gift and it's his favorite gaming keyboard by far. The lights have different modes so you can change it how you want a feature he really likes.",
    null
  ],
  [
    "CCraig",
    "",
    "Great red switch keyboard, nice quality for the price. Lights and keys all good. Still works great after 6 months.",
    null
  ],
  [
    "T",
    "",
    "I had a Black Shark Sixgill keyboard from my work, and that keyboard broke after around 4 month. Some of the keys that were used on the daily for 8+ hours during work, such as the left CTRL, the Z, C and Y keys have gone bad. Most of the times these broken key switches would not register, and I have to press 5-10 times before it finally register a stroke. Since I needed a cheap mechanical keyboard for work, I ordered another one of these keyboards with my own money, I'll see how long the switches last and report back.Ergonomically, its your run of the mill keyboard. The blue switches are a tad light than my Cherry MX Blue keyboard  (AOC AGK700).  But the consistency isn't up to par to the Cherry MX Blue, with some keys feeling a tad lighter and heavier than the other keys.  For my design work, it's fine, since most of the times my hands on the the CTRL+Z, CTRL+Shift+Z or the CTRL+Y keys. Causal typing in Slack and writing work emails is also good as expected from a clicky and tactile blue switch.RGB on the keyboard is a bit obnoxious as I do use it for work. The backlight can be used on a single color, and the brightness is actually quite good for a budget board.Build quality is fine, not as solid as the Redragon keyboards, but it is also cheaper than the Redragons.",
    null
  ],
  [
    "Christopher",
    "",
    "The media could not be loaded.\n                \n\n\n\n I've been using this keyboard since it arrived and have been impressed up to this point. Works great, looks great, and feels/sounds wonderful. However today I noticed that the 'j' key is out of sync, and this shows through many of the multi rgb modes. I am hoping this is a quick fix and will update later with any results.",
    null
  ],
  [
    "lugubrious shibo",
    "",
    "This keyboard is awesome for the 60cad price. I think I got it on sale for 45.  I've bought 3 keyboards in the past 2 years or so, for around the same price point and this one blows them out of the water. Most keyboards for this price point will be membrane, and mechanical keyboards are just so much better. I got the blue switches and they feel really good. Compared to the other keyboards I've had in the past this one is great. The lighting effects are also pretty cool and it also has individual key lighting.  The materials used feel good and not cheap.  I would recommend this keyboard to friends / family. If you are thinking about it, it's much better than other keyboards in the price point, at least ones I've had before. The blue switches are loud and clicky. If you don't like that, I'd go for the red  switches. The blue switches are more tactile and I like the clicky sound personally.",
    null
  ],
  [
    "C. Shannon",
    "",
    "Replaced my work keyboard (membrane) with this one. Very happy with the item overall. Very solid with no real bend when typing.",
    null
  ],
  [
    "Quad",
    "",
    "bought this as a stop-gap while I shopped for a more permanent expensive solution - I might procrastinate on that shopping for a while, this is a great keyboard full stop.Keys are a little heavy even for blues, but that comes with the territory of budget keyboard shopping. Lighting is fantastic, and has several good stealth modes. No trouble with ghosting yet, although I haven't tested too extensively.",
    null
  ],
  [
    "Shawn Clift",
    "",
    "This is my first mechanical keyboard and I really like it. The red switches aren't too clicky which is great but just clicky enough that it's still kind of cool. The LED backlit keys are great for seeing in the dark and the modes on it are also really fun. I do however wish that there was a simple on as opposed to lighting effects, I don't always need an LED rainbow keyboard sometimes just on will do.",
    null
  ],
  [
    "Ryan",
    "",
    "Only been two months and some keys are not registering properly.I'm still waiting for customer support to reply.Using this keyboard for about 3~5 hours a day for about 3-4 days/week, so I guess this would be good for very casual use.",
    null
  ],
  [
    "Dronoclus",
    "",
    "Really cool with like 30 different light settings. High keys so easy to miss click. And Really sensitive response so easy double letter. But a solid heavy design weighing like 2 lbs. Not many open spots to grab on to.",
    null
  ],
  [
    "Nathan B.",
    "",
    "Just a bangernof ankeyboard. Sounds just like the ducky One mini. Switches don't clang and they have great response time. I'm top 1% in league of legends and I need a good Keyboard!Thanks for this awesome product.",
    null
  ],
  [
    "A Mazing Person",
    "",
    "Everything is fine with the keyboard.I have no issues.",
    null
  ],
  [
    "Lindsay",
    "",
    "I started noticing issues with my keyboard today. The spacebar required multiple presses to register and sometimes buttons would bring up random menus like they're being scrambled. Once I start having these problems, they're almost impossible to fix. The screws practically came pre-stripped and despite having small screwdrivers that will work on just about anything, they're useless here. I can't take apart the keyboard to see what's going on underneath the keys and that's incredibly frustrating. Before that, I would have rated it a really solid keyboard. But for now, I've had to pull out my old logitech wireless keyboard to use while I try to troubleshoot this.",
    null
  ],
  [
    "Manuelito Torres",
    "",
    "So far so good.  Works as expected as it is.  The tick sound and feel of Red, wow.",
    null
  ],
  [
    "Lindsey",
    "",
    "Using this keyboard as I type. Love the colours and the clicking sound it makes haha.Its not a quiet keyboard love how the keys light up too",
    null
  ],
  ["Joely", "", "Good deal love the lights", null],
  [
    "Dan",
    "",
    "The response  time is better them my old 25$ mechanical keyboard. Happy with  this purchase. Justgamer",
    null
  ],
  ["Porter Davis", "", "Smooth, easy touch.", null],
  [
    "Charlotte Demers",
    "",
    "I simply love it !! The sound is amazing, but if you're looking for a quiet keyboard, this is not for you !",
    null
  ],
  [
    "Rene",
    "",
    "The media could not be loaded.\n                \n\n\n\n if u are looking  for a great gaiming keyboard,  this is the keyboard  you are looking for.  Recommended.",
    null
  ],
  ["Allen Shewchuk", "", "keyboard works perfect rgb is excellent!", null],
  [
    "Varun",
    "",
    "I purchased the keyboard and enjoyed the background glow lighting but after 2 weeks some of the keys stopped functioning and started writing in gibberish. Not worth the price!Thank you!",
    null
  ],
  [
    "joel bm",
    "",
    "Diseño, quizas si ofertaron el producto en configuración español, estaría genial",
    null
  ],
  [
    "Alfie D",
    "",
    "Low quality, never had a keyboard die so quickly just 5 months of use.",
    null
  ],
  [
    "shelly",
    "",
    "When you press some of the keys at the top row it rings like a bell when using the leg stands, had to fix my old keyboard because the ring got very annoying after 5 minutes of typing. overall, just buy something different.",
    null
  ],
  [
    "Some One",
    "",
    "I am a fans for the blue switch but I really hate the metallic sound every time I hit a single button. Return due to this issue. If you do not mind the metallic ping sound, it’s ok to have though.",
    null
  ],
  [
    "xzu",
    "",
    "Well, I got myself the Black Shark Mako M2 mouse and then I saw the Black Shark Sixgill K2 wired mechanical keyboard on offer and I thought they’d make a smashing pair.  As always, Black Shark gets high marks for presentation.  The keyboard came in a beautifully-designed, full-colour, shrink-wrapped box which makes this very suitable to give as a gift to your favourite gamer.  Inside the box you’ll find the keyboard securely wrapped in light foam, key-puller, the manual, and a thank you card.WOW…this is a beautiful looking keyboard…it’s black, it’s sleek, it has kind of a retro feel, and it’s got RGB lights…what’s not to love???  The metal base-plate makes it feel soooo premium, too!  It’s a high-end looking keyboard.  The rainbow RGB colour strip and the RGB lighting around the keys pops on the flat black. This keyboard gives you 12 different lighting effects and 8 solid colours which you can change via keyboard shortcuts laid out in the manual. It has onboard memory for a custom lighting group. The keycaps are made of a durable-feeling ABS plastic and feel good on the fingertips. I got the extended keyboard which has 104 keys and the full number pad, which I prefer.  This keyboard is wired with a rather long USB cord.  The keys don’t need much force at all to respond and, if you like those satisfying clicks while typing, you’re going to enjoy the blue switches of this particular keyboard…just be aware, this is a rather loud keyboard compared to the usual keyboard. Black Shark claims their keys have a 50 million keystroke lifecycle…that’s A LOT of keystrokes!  On the bottom you’ll find pull-out rubber feet on the bottom that work smoothly and prevent the keyboard from slippingThe keyboard is plug-and-play but downloading and installing the app will allow you to customize your keyboard.  The app gives you plenty of lighting effect control and macro programming.  If you’re a gamer, you’re gonna want the app.About the only con I can think of to this keyboard is the fact that the wire is attached.  Should the wire split, fray, or become otherwise damaged, there is no way to replace the wire…you have to replace the entire keyboard which is wasteful.  This keyboard is priced regularly at just a penny under $60, but as I write this review (on my Black Shark Sixgill K2), Black Shark is offering a $5 coupon, bringing the price down to just a penny under $55.  Since this is such a well-built keyboard that looks and feels premium and has customization available through the app, I give this my full recommendation.  I hope this review has helped you to make an informed purchasing decision.",
    null
  ],
  [
    "LiveWire",
    "",
    "I accepted to opportunity to test this wired RGB keyboard from Black Shark as I wanted to see how this compared with my current 87 key wired gaming keyboard setup. I had recently also tried some 60% styles, wired/wireless keyboards and I found that I did not like that size at all. I had started using a slighty \"compact\" 87 key board, but I was really wanting to look at going to fullsize units again. This Black Shark unit looked like it could fill that role....OK, in actual use...I am pleased to say that I could not detect any lag or any issues at all with this in fully WIRED mode. And that is just fine because I still prefer staying WIRED in my uses. Recently, I have tried a few that were all wireless BT affairs (keyboard and mouse) but they just seemed to not be spot on. This is why I prefer to just stay with a wired setup like in the Black Shark being reviewed here... NO lag/connection issues to worry about! It just works as intended and I like that.This layout is very ergonomic in my opinion. I found typing on this keyboard to be very comfortable. While it's not an IBM (for those of you that remember!), it does produce a satisfying \"clicky\" effect. I selected the version equipped with BLUE switches. I have always preferred Blue switch based keyboards. This is strictly a personal taste thing really. If \"clicky\" keyboards are not your thing, then this particular keyboard is probably not for you.The RGB lighting looks great! There are many keyboards out there with a multitude of lighting options, but this one is just fine in my books with 12 available modes of RGB backlighting and 3 modes for \"side lighting\". The Black Shark GUI style driver app is professionaly done, works well and very intuitive. But I have to say that I really appreciate that you can actually work a majority of the keyboard rgb lighting functions by simply working with FN key combinations that do not even involve using the driver app. Its good to have options!After using this for about 2 weeks I have to say that I am impressed with this Black Shark full size RGB keyboard. It works as intended and looks great, both in physical appearane and with its lighting capabilities. I find that while I did not really care much for the 60% style at all, I still much prefer this type of full size keyboard for doing double duty as both a gaming keyboard and a daily driver for productivity and office use. I get that many want a really compact keyboard these days, but one of the things I hated about the 60% (or even 87 key styles) is that you either don't not have a proper row of top function keys, but intead combines the function keys with the number keys requiring you to use multi-button key presses to accomplish a desired input. And even the 84/87 keyboards still make compromises in the areas of numerical pads, cursor keys, etc. For me, this full size will always be my preferred size and layout.Overall, I really like this keyboard. But, at the original listing price of just $49.99, I feel that it is good value for money for what you are getting here. I know there are a TON of RGB keyboards of all types and styles on Amazon, but I think this one is worth being on your list of possible considerations if you happen to be looking for one. I am giving this a solid 4 out of 5. It is very good.. just not \"perfect\", but, I think you can purchase this brand with confidence.",
    null
  ],
  [
    "SMB",
    "",
    "This is an excellent wired mechanical keyboard for the price based on its overall build quality, features, usability, and RGB/lighting capabilities.First thing first, I'm very particular about keyboards (well, I guess most people are). I have dozens of these over the years (and still do) and more often than not what I'd get is what I expect (more or less). Well, this particular keyboard is a pleasant surprise to say the least. I thought this would be one of those budget mechanical keyboards that I've seen so many (and still have a few) over the years but I was wrong. Well, it's a budget only in the sense of how much it cost.I mostly only have keyboards with floating keycaps because that's what I like and prefer for a number of reasons which I won't into right now. The keyboard itself appears well made and well-constructed without any visible defects. It's relatively heavy similar to many quality mechanical keyboard. The keycaps are of decent quality as well although they might be the weakest point for the keyboard. With that being said, its still decent for what it provides.These are blue switches so they are clicky and loud which I like and prefer. The actuation force is around 60gf which is typical of blue switches along with 2.0mm actuation distance and 50 mil keystrokes. While it's difficult for me to verify any of these claims, it does have a similar feel in comparison with most blue switches that I have so I'm happy about that.The RGB colors are for all intents and purposes (what concerns me anyway) fully customizable via the keyboard itself without requiring any additional software (only Windows is supported though). Individual keys can be customized with any one of the 7 colors with up to 5 customized profiles and you can use any of the 5 pre-configured if they suits your needs. Keep in mind that there are a total of 5 customized color profiles including the pre-configured profiles so if you customize one profile, then you are gonna lose the existing pre-configure settings (you can't start configuring based on existing profile; you can only start anew). There are also 12 lighting effects to choose from. As with many other RGB keyboards, you can set brightness, speed at which various effects changes, or completely turn them off. In addition, there are also RGB lighting along the 3 sides of the keyboard that I don't usually see (though I do have 3 of those and find 'em annoying at times).The overall quality of the RGB lighting is decent but not the best; they are a bit dim for my liking but I digress. I also prefer keys that can be modified with the SHIFT key having letters oriented vertically (top/bottom) rather than side-by-side (e.g. square bracket and curly bracket). As such, I find these keycaps, well, annoying. Lastly, the cord is NOT nylon braided which again is a bit disappointing to see but it's by no means a deal breaker (far from it).All things considered, this is an excellent wired mechanical keyboard with fully customized RGB that is very reasonably priced at $45 (with discounts) that falls into the category of being a 'steal' at this price. It would still be a great price at $60 (regular) for its overall build quality, features, usability, and RGB capabilities. If you are looking for a blue switch mechanical keyboard, I'd say give this a shot because it's amongst one of the BEST at this price point.",
    null
  ],
  [
    "Iohn Born",
    "",
    "This Black Shark mechanical keyboard looks a lot like my Logitech G512 keyboard: a similar graphite-coloured aluminium round-cornered base with elevated black keys and similar placement of the logo. However, Black Shark really went all-in with the lighting on their keyboard and not only are the characters illuminated but so are the bottom of each key as well as the sides of the keyboard itself. There was a risk of overkill and much cheesiness but somehow it all gels together and works well. When I first plugged it in I have to admit that I was impressed. To change the lighting, the keyboard has a few in-built RGB modes accessible through FN+Print Screen. Even though there is an app you can download for further customization -- I have not installed it yet -- you can start enjoying the RGB right out of the box.On the KB's underside are two sturdy foldable feet with anti-slip rubber paddings as well as three additional rubber pads. Together they keep the KB stable when in use.Once you start typing, that's where you notice the difference between the Logitech and the Black Shark. While not mushy, the keys on the Black Shark feel a bit soft and I would have preferred a more resistance. Being a blue-switch KB, it has, unsurprisingly, a very pronounced clicky sound but the latter is a bit too high-pitched for my taste and bottoms out with a distinct metallic ping which some users may find even more irritating. Despite this, typing on the KB is fast and precise. Let's hope the sound will grow on me in the long run. Alternatively, the keys could be switched out and a keycap puller is included in the box.A much-appreciated feature of this KB is the inclusion of media controls as the FN alternates of the F1 to F8 keys. For anybody who likes to listen to music while working, these controls are incredibly handy: you can quickly pause, change track or adjust the volume without having to switch out of your document.Overall, this is a very decent mechanical keyboard. It feels sturdy and durable with good heft and stability. While the keys are a bit soft and their sound could be irritating to some users, both are a question of personal preference and functionally the keys are fast and precise. If you can live with these flaws, then for ~$45, when including the current $15 coupon, this KB is a great value.",
    null
  ],
  [
    "AmazonAlex",
    "",
    "The Black Shark RGB Mechanical Gaming Keyboard with 'blue' mechanical switches provides a decent entry level quality gaming keyboard experience. The click is loud as expected but the constantly backplate/spring noise is less less welcome. On the upside, build quality is remarkable for a sub $50CAD keyboard. The keycaps feel nice for ABS and the RBG looks great with lots of versatile options. The feet are simple with one incline setting and have nice rubber bottoms preventing sliding. A keycap upgrade on this could really improve the overall experience.The typing quality, while a matter of personal preference, is not bad if you like a heavier switch. If you're more interested in precision rather than speed, this keyboard does a decent job allowing you to feel and hear each stroke. It's fairly easy not to bottom out these keys which is good but there is a heavy initial force required which makes it feel almost like the heaviest point of resistance is the initial key press. If you focus less on being quieter and just hammer out the keys, it's easier to get used to the high force and it becomes fun to type. Again, precision over speed and the result isn't too bad if you can accept that. In some ways, you may feel you can type on these keys for longer because you probably won't bottom out as much as you would with a linear switch. I certainly didn't feel any fatigue in my limited time testing which is a good sign. Only wish the backspace didn't feel as heavy as the rest of the keys but it does. That backplate/spring sound is fairly intrusive on the overall experience.Bottom line: Nice entry level keyboard with super cool RGB, decent build quality despite ABS keycaps and divorce inducing clickiness. The operating force is too heavy for my liking but if you learn to not bottom out, this can be a decent typing companion. I've given other favourable reviews to Black Shark products and this one fits the mission of entry-level value. Would have been nice to see a linear switch option or an option to include name-brand switches at a higher cost (like Gateron yellows).Cable is not detachable. LED strip going around the bottom of the backplate looks really cool. Board feels fairly responsive in terms of input lag but not instantaneous in my limited time testing make me question gaming credentials.",
    null
  ],
  [
    "R. U. Shureuwantthis",
    "",
    "Received for unbiased review...Please note: you will need to download their software from their web site to modify the lighting effects.  The software also gives you the ability to customize your own lighting, and to create key macros.  The software does not have a Microsoft certification, so you will have to deal with Windows attempting to block the software from being downloaded or installed.  I tested the product with and without the software.  Without the software you will get a traveling rainbow effect on the keyboard as its default.  With the software, you get several cool presets of different effects.  The keys are easy to press and the loud click gives you an audible cue that you have pressed a key.  Unfortunately, you likely won't be able to use this keyboard in an office environment because the high pitched click of the key press is very loud and may disturb anyone within earshot.  I can't say that it is a pleasant sounding click.  I would probably prefer the actual sound of a mechanical typewriter over this sound.  This is why I'm reducing one star.  The key caps are removable and it comes with a removal tool.  The switches are also replaceable.  The USB cable is not removeable if you should need to replace it.  The keyboard over all has a very solid aluminum feel and has weight to it.  It isn't likely to slide around on your desk while playing intense games.  The silicon feet combined with its weight help considerably.  It is a well made keyboard, and feels like it should last.",
    null
  ],
  [
    "Richie Rich",
    "",
    "The Black Shark Sixgill K2 Mechanical Gaming Keyboard is a good value when it comes to entry-level mechanical keyboards. It has a solid build quality with aluminum panel that is very rigid and doesn't flex. Despite the metal construction, the keyboard is fairly lightweight for a full-sized keyboard. The keycaps are decent with a matte finish with a subtle soft touch coating on top. The K2 looks and feels more premium than the price would suggest.There is a plethora of RGB lighting settings you change with key combos, including 12 lighting effects, 8 colour settings, 3 surround lighting effects, 8 surround lighting colour settings and 5 gaming light effects for enhancing certain genres like FPS and racing games. You can also change brightness, lighting effect speed and save your custom lighting effects. Just keep the manual handy so you know what key combinations do what. The RGB lighting is excellent, bright and having that extra surround lighting strip that goes around the keyboard enhances the mood when gaming.The K2 does use blue clicky switches, which are responsive but I did find the keys required more weight to actuate than other keyboards also using blue switches. I also found these switches were noisy and not in a good way. While they are clicky, there is added reverb sound that is unrefined and unlike other more premium mechanical keyboards. I thought the typing experience was fine, and the keys had a bit of a wobble if pressed from the corners, but it wasn't terrible. However, the focus and primary audience for this keyboard is the gamer and I think as an entry-level mechanical keyboard, it is built well, performs well, looks great and is a good value.",
    null
  ],
  [
    "Ty",
    "",
    "Let me just be super upfront and direct here. Do I like this keyboard? Yes. Yes, I do. Very much, actually. The Black Shark Sixgill K2 is my new daily driver, despite owning far more expensive options from core brands, with more features and better quality switches, the Sixgill K2 has somehow managed to make me question just what makes a quality keyboard, a \"quality\" keyboard.Let's talk about the good, and the bad, in an easy to understand format; pros and cons!PROS- The build quality is truly one of the best things that the Sixgill K2 has going for it. There is very little to no deck flex, which is to be expected, considering it's got a metal backplate holding everything together.- The RGB is bright, and easily customizable via the Black Shark software.- Speaking of software, the software that this keyboard uses for customization (which can be downloaded via the Black Shark website) is actually surprisingly easy to use. In fact, it's easier than Corsair's thing, at least in my opinion.- The typing experience is top-notch! Now, I can typically type at around 120 words per minute using red switches, but with this keyboard, and particularly because it's using the blue switch, I'm able to type at 180 words per minute. This is the fastest typing score I've ever been able to achieve.- The gaming experience is less-stellar, but still fantastic all the same! Seriously, I do esport stuff, so am \"technically\" a pro gamer, in the sense that I compete for money in various gaming competitions. The Sixgill K2 has actually become my go-to for tournament play, as it's relatively small, and thus easy to travel with. But beyond that, I find that the key accuracy and response rates are on-par with the other keyboards I've used. I also don't encounter any ghosting, or \"false presses\". The key actuation point isn't what I'd consider to be ideal, but it's fine. Zero complaints!- The Sixgill K2 is the best $50 keyboard I have ever used, without question.CONS- The blue switches are questionable, as far as quality and sound go. I'm not actually that much of a fan of the way these switches sound, to a point where I question their longevity. There's a distinct \"spring\" sound with every key press, that I do not experience when using other blue keyboards. There's also a noticeable key wobble, but only with some keys.- The RGB is perhaps a bit too intensive. I tend to prefer a more sleek and dimmed-down keyboard, whenever possible. The fact that this keyboard has what is effectively an under-glow may be a bonus for some people, but for me, it's just an annoyance. A minor annoyance, sure. But still.- The wire could be a tad longer. At its current length, it works fine for my intended use. However, if you have your tower further away and intend to plug the keyboard into one of the USB ports on the back for cleaner cable management, you may find that the wire simply isn't long enough to reach all the way back there. Your milage may of course vary.All in all, this keyboard has somehow managed to become my new daily driver, mostly due to its size and general convenience. Fact is, my Corsair K70 Lux is a better keyboard, in practically every single way. And yet, I find myself using the Sixgill K2.So, do I recommend it? Yes, absolutely.",
    null
  ],
  [
    "J. Miller",
    "",
    "The media could not be loaded.\n                \n\n\n\n This Black Shark RGB Mechanical Gaming Keyboard is a pretty solid option once you factory in the coupon (without coupon the value proposition is questionable), but only if you like a loud and very clicky keyboard.The Good:- Solid build quality overall. No flex. Pretty good weight to it.- Full size.- Lots of cool multi-colour lighting options if that's your thing. You can adjust brightness, colour, speed, etc. It also has a response based option, so if you hit the G key for example the lights animate outward from that key in a wave.- There is also side lighting in addition to the key lighting, which is pretty unique- Very distinct click mid-actuation (if that's your thing)- Nice feeling keycaps- It has some multimedia functionality when using the function keyThe Questionable:- These aren't cherry MX switches so it's hard to speculate on long term wear and tear- This is a LOUD keyboard. Some people love that, love the very distinct and loud clicks, others prefer a more silent mechanical keyboard.- No included wrist rest is unfortunateThe Blackshark gaming software (optional to use) lets you further customize lighting, add macros, or even outright disable keys. I keep my PC as clean as possible in terms of any possible bloatware, so I can't comment on the software.Overall it's a good budget mechanical keyboard, but I would strongly urge you to consider whether you want a loud keyboard or not. Like if anyone is sleeping nearby when you are using this thing... well, they won't be sleeping! But if you crave that loud click then this is for you.",
    null
  ],
  [
    "Adrian M",
    "",
    "I’d never heard of the Blackshark company, but I’ll be on the lookout for more of their products after using this keyboard.  It’s extremely well made and feels very durable.  They obviously put a lot of thought into this design, and it shows.  I'm very impressed.Build quality is excellent.  It’s like a little tank…robust and rugged.  Though hefty, it has a fairly compact footprint and is just light enough not to be a hindrance on your desk.  It’s plug and play with no need to install any software.  The action of the keys is very comfortable, and I love the satin finish on the surfaces.  That said, I found them bothersomely loud when I type.  The F1-12 keys have secondary assignments that cover most of the basic shortcuts you’d want (volume up/down/mute, media controls, email, browser, calculator and search).Looks-wise, it’s very classy.  The black aesthetic combined with multicolour lighting is eye-catching without being distracting.  I love being able to type in the dark and still see the keyboard.  There are several lighting options to choose from that can be dimmed or edited to suit your personal preferences.Pros:-Excellent build quality and looks-Plug and play-Built-in shortcuts (music, volume up/down/mute, media controls, email, browser, calculator and search)-Full keyboard that doesn’t take up too much real estate on your desk-Very comfortable keys with satin-finish surfaces-Lots of lighting patterns to choose from (with editing capability)-Good manual (short but informative)-Manual advises not to run through a USB hub, but I'm having no issues at allCons:-Keys are very loud.  It almost sounds like an old-fashioned electric typewriter.-Pricey compared to other keyboards on AmazonThis is easily the best keyboard I’ve ever used, and the biologist in me wants to geek out over the “sixgill” designation.  This appears to be the only product they’ve named after a shark species, but I hope they continue.  This is my first gaming keyboard, so value is hard to pin down.  It’s a little on the pricey side, but the build quality is next level and I would recommend it without hesitation.My rating: 4.5 stars",
    null
  ],
  [
    "lmcjipo",
    "",
    "I had a 60% mechanical gaming wired keyboard so decided to test out a full sized mechanical gaming keyboard.This keyboard seems to fit the bill.When plugged into my Windows 10 computer and the computer is powered up, the keyboard lit up in a pattern which really looks cool/nice.The keyboard plugs into the computer using regular USB-A cable and this cable is physically attached to the keyboard. If your computer/laptop doesn't have any standard USB-A ports, you'll need an adapter or a USB docking station.I'm a touch typist and I might be dating myself but I learned how to type on an old fashion manual typewriter and I find that my typing accuracy is improved with this keyboard. Unlike some other \"normal\" keyboards where the keys feel \"mushy\" and somewhat uncomfortable to type, I feel very comfortable using this keyboard. However, this isn't the most comfortable mechanical keyboard that I've used. The 60% size mechanical gaming keyboard that I have feels a bit better when I type (I can't explain it).I wouldn't recommend this in a cubicle work environment or where you share your office with multiple people as the sound of the keys when typing can be annoying to some people. I don't have an issue with the noise and I use the keyboard in my home office as well as when I'm playing some online games and it performs well in both situations.Being a touch typist, I can generally type without needing to look at the keys and when using my computer in a darkened room, the LED keyboard still makes it easier to type as I don't have to feel the keys to try to figure out where the F and J keys are when positioning my fingers (as these keys have a \"bump\" on most if not all QWERTY keyboards).Included in the box is the keyboard itself, a tool to remove any key from the keyboard, and a multi-language instructional booklet.",
    null
  ],
  [
    "Tribalistas",
    "",
    "The media could not be loaded.\n                \n\n\n\n Mechanical keyboards are pretty much the pinnacle of gaming keyboards. Some known brands sell mechanical keyboards for hundreds of dollars. The way the keys are set on the frame make the difference. A sensitive technology is used to hold the keys while a mechanical switch is being used to facilitate the up and down movements of the keys. Different switches (colours vary between yellow, brown, white, black, plus some variations including purple or pink) will feel different and will have a different pressure point.Black Shark offers a mechanical keyboard at an acceptable entry price of $60 ($15 coupon at the moment) But is it any good?The keyboard is sturdy, small and very loud! Too loud for my taste. I usually use either Razer or Logitech products. Mechanical keyboards are really loud in general and usually buyers are aware. This keyboard is no difference. It uses blue switches which are usually the loudest among all mechanical switches.The sounds are inconsistent as you can hear in the video. The enter key has totally different sound than all other keys. Why?The Black Shark Sixgill K2 has an aluminum frame and black hard plastic. The cable is a thick but simple USB 2.0 cable. The length is sufficient.The RGB lights look really nice and are definitely on pair with my Razer keyboard.Black Sharks software was at first blocked by my Windows Firewall. I installed it anyway. The layout of the interface looks like the one Razer uses. There are a couple of settings to adjust the RGB lighting. That all works fine.However, other brands go way beyond that in their software. They let you choose layouts for certain games for example. Black Sharks software isn't that advanced yet.One criticism is that the space key is uneven. Please look at the picture to see the problem. While not a huge problem when using it, this issue needs to be fixed.Some other keys, especially the Windows key, ALT and the F1-F12 keys are a little loose. Nothing major, yet the quality isn't great and that's where the difference between a $150 brand keyboard and the Black Shark lays.The mechanical switches are plastic and seems rather cheap compared to other brands.If you really want a mechanical keyboard and you don't want to break the bank, the Black Shark is good if you can get over the key issues.Yet, you get very good non-mechanical keyboards from Logitech and Razer for $60. That might be the better option as they have better software and usually better build quality.",
    null
  ],
  [
    "Jelena D",
    "",
    "This review is for Black Shark RGB Mechanical Gaming Keyboard LED Backlit Wired Keyboard with Blue Switches, Full Anti-Ghosting 104 Keys, Aluminum Base, for Desktop PC, Sixgill K2, $44.99 after the $15 couponPros:- Excellent build, heavy. Nice keycaps- Excellent RGB, especially the ripple effect- Love the blue switch, music to my ears- Long cable at 60 inches- Anti-slip rubber pads on the bottom- Foldable feet to angle the keyboard if required- Plug & Play, no driver required- Comes in a sealed package, very giftableCons:- The keyboard is too wide - wider than a standard keyboard. Wish it was a little narrower. Wide keyboards are not ergonomicOverall, I am very satisfied with this keyboard",
    null
  ],
  [
    "AJ Ferda",
    "",
    "Ok.  So, first up I have to say that being a blue switch keyboard does not make it perfect for gaming for SOME people.  Typically, red or brown switches are preferred.  FYI: Switch colors - Blue: more for typing and general purpose use.  Red - Preferred gaming key with less pressure needed, no mechanical feel. Brown - A good all around gaming and work key.I don't use my keyboard much in gaming as my primary games are race sims and Destiny/Division 2 and I use a controller for those.I love the feel of these keys but there's a lot more to this keyboard.  It has a very sturdy aluminum chassis, a good weight to it so it's not sliding around, and the RGB lighting actually has grown on me with this keyboard.  It will work great out of the box being plug and play but you can get some software for it if you want to.Being a wired keyboard the response time is excellent and has no lag.  I have been impressed with a lot of Black Shark's products and this is one of them.  It's stylish, (as much as a keyboard can be) and if you're a fan of that loud, old fashioned key sound like me; you'll love this.It does not come afaik with any other switch variations so if you are a super sweaty FPS player this probably won't be for you.  But for the rest of us, if you love the sound and love annoying others with your clickety-clack....you've hit the Bingpot!  (5pts for getting that reference)Easy recommend at $60CAD for the build quality, key accuracy, and feel.",
    null
  ],
  [
    "Sean R.",
    "",
    "the keyboard is well made and the RBB lighting looks good. theres a lighting strip going around the edge, but you wont be abel to see it for the most part if you have a wrist wrest. they keys light up and the back lighting is well done making the key labels look sharp.i didnt give this keyboard full stars as i dont like the way the keys move/click. they have a lot of travel in the movement and make a loud click halfway, then when released they snap back in place and make another sound. everytime you hit a key it makes 2 different noises, and that adds up to a lot of sound if you type 60 words per minute. i would be fine if all you want to do is hold W, but even writing this article now im getting pretty sick of the clicky keys and dont want to use it.",
    null
  ],
  [
    "Gimli",
    "",
    "As I'm typing this, the keyboard costs only $40. This is an *incredible* value for a good quality mechanical keyboard.I have nothing to complain about. All the keys are where I expect them to be. The LED lighting can be easily configured or turned off altogether. The keys have a pleasant satin feel to them. The mechanical action is just as expected - both tactile and audible feedback. The keys are easy to press, and the sound they make is uniform across the keyboard.I think that you'd be hard pressed to find a better keyboard for $40.",
    null
  ],
  [
    "SuperE",
    "",
    "If you're looking for a full size keyboard at a very reasonable price, then this Black Shark mechanical gaming keyboard could be worth looking at - if you're ok with very clicky keys. I'm a fan of loud keyboards, and use them on all my PCs, however, blue switches are among the loudest and I don't recommend this keyboard if you're using it in a work environment with other people around. That said, the build quality and typing performance is excellent, and I do like the fact that you can control the lighting without ever installing the optional software. The software does give you further customization options for the keyboard, so it may still worth be checking out, however, this is still a very plug-and-play keyboard if you aren't looking for those other options. The glow of the RBG lighting is clean and the RGB light strip that runs along the base of the keyboard is really, really nice! None of my other RGB keyboards have lights there, and it makes a huge aesthetic difference. The frame of the keyboard is aluminum, which further adds to its built-quality and overall feel. There is zero flex or bending from this keyboard, and it can handle even the most aggressive gaming sessions. At under $60 with a $15 coupon (as of mid-April, 2022), this is one of the best values you can get for such a high-quality keyboard.",
    null
  ],
  [
    "Mark Twain",
    "",
    "The media could not be loaded.\n                \n\n\n\n I acquired this product mainly due to the positive things I've heard regarding the improved ergonomics and typing speed offered by mechanical keyboards in general (e.g. less pressure required per key press). I definitely get clear audio and tactile feedback, and the keystrokes feel very crisp. I'm finding that my mind is becoming attuned to the clickety sound that indicates a character has been pressed, helping me to improve my accuracy. In comparison, my non-mechanical keyboard already feels mushier and somewhat less responsive when I switch back to it.Apparently, there's a whole community of mechanical keyboard enthusiasts for whom the exact audio quality of the key \"click\" is a pretty big deal, so I've included a short video to provide a sample of the sound. I can't say if the sound is better or worse than others since I don't have a point of comparison.In addition to typing, I also tried out a truck driving game and found that, to my surprise, the controls did indeed feel more responsive and make the experience more enjoyable.The housing for the keyboard is very rigid and sturdy, and has some heft to it for the relatively compact size. It also has a pair of optional miniature stands that can be pulled out if you prefer a slight upward tilt. The package also comes with a key puller, which is a nice touch.While I didn't necessarily acquire this keyboard for the lighting effects, the arrangements are very fascinating to watch when I need a break. However, you can also disable the lights if they're distracting.All in all, the notion of a mechanical keyboard seemed somewhat gimmicky to me, but the differences compared to a non-mechanical have definitely become clear to me after a few days of using this device.",
    null
  ],
  [
    "To-The-Point Reviews",
    "",
    "Prior to this keyboard, I had been using a Corsair keyboard for pretty much 8 years and it had been doing well. I loved it and, because of it, I had high standards for any keyboard I was going to use to replace it. Then this Black Shark keyboard showed up and it has officially become my new keyboard.The mechanical clacking sound is nice, although a little loud, but that doesn't bother me as I use noise cancelling headphones and am still able to slightly hear the clickity clack while wearing them which is nice. The keys feel solid and responsive, and I actually got used to typing on it incredibly quickly. The various lighting effects and colours are fun to cycle through and use, and there's bound to be something for everybody since there are just so many options. On the desk, the keyboard looks nice and fits with my overall computer. I love this keyboard and am immensely happy I got it, so do yourself a favour and get yourself one as well.",
    null
  ],
  [
    "Jazzy G",
    "",
    "The media could not be loaded.\n                \n\n\n\n PROS:- durable build with a metal top face- mechanical switches and replaceable keys- programmable RGB; allows you to select from many settings- RGB perimeter border at the base- rubber feet to keep it in place- lengthy cable to USB-A connectorCONS:- not custom programmable RGBI have several Black Shark products and I have really been amazed by their quality and value!  Their RGB Mechanical Keyboard is not different - you'll get an amazing mechanical keyboard that performs really well!This keyboard comes in slick black packaging.  the keyboard itself has a very durable build - it feels nice and hefty to keep it planted wherever you place it.  The main body has a metal face that is dark grey which really compliments the matt black keys.The keys are all matt black, which looks stealth.  Each key is lit by the RGB lighting beneath.  The switches are really nice, with nice actuation and a medium \"clicky\" sound.  It isn't terribly loud, though it still resonates more than your typical keyboard.I love how the base perimeter also has an LED band that follows the programming of the keys.  It's never distracting and makes the keyboard look intense!I use this keyboard for daily work, which I use Office products all day (mostly Excel).  This keyboard performs great, allowing me to ensure my input is complete.  The keys feel really good and have a nice texture to them.  The only thing about the matt finish is that it shows if you have greasy fingers.Overall, the Black Shark Mechanical Keyboard is a great value!  I would say it is an excellent choice if you are looking for a mechanical keyboard that performs without breaking the bank!  You'll love it!",
    null
  ],
  [
    "M and C",
    "",
    "This is a fantastic gaming keyboard if you are looking to upgrade from a traditional style.  The blue clicky switches are responsive and the lighting on this keyboard mirrors more expensive models or options.  I have several Blackshark products and all are great quality.  Highly recommend.",
    null
  ],
  [
    "Clarabelle",
    "",
    "This keyboard has a good weight to it and the materials are of good quality.Mechanical keyboards are noisier than any other type of keyboard because there are clicks at both the beginning and end of keystrokes - I love the tactile this keyboard gives, coming from a Mac keyboard this was an adjustment but have come to really like it.I keep the backlight on white but you can choose whatever color you prefer, the letters on the keyboard are cut out and not painted on so the light shines through each key and you don't have to worry about them wearing off.I was happy to discover I can still do snapshots and screenshots while using this on my iMac by using Shft+Windows key+3 or Shft+Windows key+4.My son is now eyeing this up and will likely be purchasing one for him now lol.",
    null
  ],
  [
    "LJ",
    "",
    "Mixed feelings about this keyboard.  I like the compact full form that includes a number pad.  Doesn’t take up a lot of desk space, and the aluminum build quality looks and feels good. Little heft to it that keeps it nicely planted on your desk, and feels solid.  Looks and feels like a premium keyboard until you use it.  Unfortunately, there is a fair amount of slop and chatter to the keys. To be fair you might not even notice it unless you’ve used a premium mechanical keyboard, but if you have, the difference is very noticeable.  The keys feel loose and there’s a fair amount of key chatter separate and apart from the clicky blue key type actuation sounds.  However, given the price, it’s arguably not a fair comparison.  It has a premium look and feel that sets it apart from other similarly priced mechanical keyboards, which often suffer similar issues at this price point.Final Thought: Little form over function here. Impressed with the premium aluminum formfactor and build quality, but not the feel or build of the keys. However, those not spoiled by a high end mechanical keyboard may well enjoy the experience, which is fairly on par with other mechanical keyboards in this range but those alternatives often look plastic and not premium like this keyboard.  3.5/5",
    null
  ],
  [
    "2009",
    "",
    "The media could not be loaded.\n                \n\n\n\n This Black Shark RGB keyboard is of  high quality and has many great features!First of all, it's colors. This keyboard comes with a wide variety of colors to choose from, and there are three multi-colored settings. The colors are bright and vibrant, and there are 12 lighting effects. Not only do the keys have RGB lighting, but the sides of the keyboards also! There are 3 lighting effects and 8 color setting for the sides of the keyboards.All keys on the keyboard are blue switched, and the keycaps are high quality, and provides high recognition for color and light, even in the dark. The letters on the keycaps are scratch-resistant, fade-resistant and anti-blurring, so there is no need to worry about them even after long term use.The keyboard itself has an ergonomic design, with two foldable stands for an easy typing angle and high-low keys. There is also anti-slip feet at the bottom of the keyboard.This keyboard comes with a keycap remover, which is helpful if you want to switch or clean the keycaps.If you want to customize the macros and light settings, you can download the Black Shark keyboard driver from their website.This keyboard is a full keyboard, with 104 anti-ghosting keys, including 12 multimedia shortcuts.The panel is made from aluminum alloy with a matte-finish texture.",
    null
  ],
  [
    "Mahmoud Heno",
    "",
    "The keyboard is made of great quality. In fact, itis much more beautiful than the pictures and thereal texture of the keyboard. The real sound ofclicking on the mechanical keyboard. This iswonderful, different from the rest of thekeyboard. I have tried many of them, but this isthe best and I am sure of my words. It alsocomes with many beautiful and comfortablemods. Thank you who made this terriblething It also has many cool color adjustments.  loved it.  It's really cool.  I advise everyone to buy, Worth a higher price than this price the quality is awesome.  :)",
    null
  ],
  [
    "Follow Trend",
    "",
    "The media could not be loaded.\n                \n\n\n\n This Black Shark keyboard is very cool- I never used a Mechanical keyboard before- So far I like especially the noise of the keys, it's loud but that's something I am looking for. The keyboard come up with manufacturing software that controls the lighting, animations, brightness, and keys customization. This key customization is cool, I have changed the Caps button for flashing when Caps is on. Keys are very easy to come out for cleaning. I found this keyboard is a good competitor against the Razer's expensive keyboards. I tried with Windows its easy to use no installation required for keyboard connectivity, OS is automatically detecting the keyboard.Best Features- Multiple lighting options and control from software- Keys customization- Easy to clean by removing keys- better responsive for gaming",
    null
  ],
  [
    "Irissia",
    "",
    "The media could not be loaded.\n                \n\n\n\n I have had multiple expensive gaming mechanical keyboards, and I actually like this keyboard better.  It is very responsive, satisfyingly clicky, but not overly so, and has nice RGB lighting and key backlighting that wraps around its metal casing.  Very happy with this purchase!",
    null
  ],
  [
    "Steve C",
    "",
    "Seriously heavy, all metal base.The keys are solid with a springy sound. 60 inch non-detachable cable with gold colored USB connector. Rubber pads on the bottom for grip and foldable feet to angle the keyboard if required.Colors are vibrant and bright. The colors and pattern can be changed with simple key strokes, no software required. Color along the base is a really nice touch.Also this keyboard is plug-and-play, so again no additional software to load onto your computer.The keys are loud but that is expected.",
    null
  ],
  [
    "Hadinma",
    "",
    "Nice looking keyboard. I like the colours under the keys and how raised the keys are. It’s quite noisy when in use and the keys aren’t as soft as my previous keyboard so that’s an adjustment for me. It does work well and looks good on my work desk. Haven’t used this gaming, only for work and I’m impressed with it. Connecting to my laptop was super easy as well.",
    null
  ],
  [
    "DoubleAA",
    "",
    "The media could not be loaded.\n                \n\n\n\n First things first, I know the description says “Gaming Keyboard”, but this one has replaced the keyboard I use in my home office. For some reason, it feels very satisfying typing on it. What I also like is the many different lighting effects. I have another RGB keyboard for my personal PC and the effects on this is nothing compared to the Black Shark.I really like this keyboard and as mentioned, I will be using this every day I am working. So far I have nothing bad to say about this except that it might be a little loud for some, but not for me. Thumbs up on this one.",
    null
  ]
]
