[
  [
    "T. Reid",
    "Good value",
    "I was pleasantly surprised when I received this keyboard. It is better than I had expected. The keys feel good, quieter and softer than a mechanical, but with good bounce.  The rainbow backlighting has several options, and the  light comes up through the keys, lighting them up as well.  I have not yet tried all the color options, or brightness settings, but so far I am very happy with the lighting.  The keyboard itself is heavier than I was expecting (I recently switched from a gaming keyboard that was so light in weight that it felt flimsy). This one has a good weight to it, not heavy but not feather-light either. I use it mostly for working and web-browsing and so far I am very satisfied with it. It says the keys are \"laser etched\" which I hope means they will hold up and not be as susceptible to wear as my last keyboard, which showed extensive key-wear after only about 2 months!  Five stars to this one.",
    5.0
  ],
  [
    "Denise",
    "Quiet But Clunky for smaller hands. Good for a cheap keyboard though.",
    "I needed a keyboard that was less noisy. The one I use is mechanical so it makes quite a bit of noise if I ever record something. It still makes noise but it isn't as bad and noise cancelling on your app or computer makes it hard to hear if you record anything. It's a bit clunky for my small hands. I don't care for the height and prefer more flat keyboards with retractable stands. Ironically because of the extra \"space\" for your palms at the bottom which I never liked I do have to use the stand to angle it a little to be comfortable despite that I don't care for the height. For a cheap keyboard it otherwise isn't too bad. Also the keys can pop off for easy cleaning which was a very nice option too. Edited: I did find the instructions and there is a way to turn off and adjust the lighting which I previously said there was no option. I stand corrected and have increased my ratings.",
    4.0
  ],
  [
    "Court",
    "I appreciate that the silent keyboard is compact and lightweight",
    "The silent keyboard has been a game-changer for me in terms of productivity and comfort. This keyboard is designed to be quieter than traditional keyboards, making it an excellent option for people who work in shared spaces or who prefer a quieter typing experience.The keys are responsive and comfortable to type on, with a satisfying tactile feedback that helps me to type accurately and quickly. The keyboard is also designed to reduce the strain on my hands and wrists, which is important for anyone who spends a lot of time typing.I appreciate that the silent keyboard is compact and lightweight, making it easy to move around and take with me on the go. It's also easy to set up and use, with no complicated software or drivers required.The design of the silent keyboard is sleek and modern, with a slim profile that looks great on my desk. It's available in a variety of colors, so I was able to choose one that fits my style and personality.Overall, I highly recommend the silent keyboard to anyone who wants a quieter, more comfortable typing experience. It's a high-quality product that has improved my productivity and reduced my typing-related discomfort.",
    5.0
  ],
  [
    "Grumpy",
    "Space Bar Issues",
    "I've been using this keyboard for a few months now with just casual web browsing ect..  The space bar has started to become a little rough to press on and times will get stuck if your not pressing directly in the middle.  If you press on either side it will get stuck sadly.  For the price it does feel comfortable to type on but dang it why the space bar :(Edit:Was able to get a full refund from seller after bringing up the issues I was experiencing with the keyboard. Very good customer service.",
    5.0
  ],
  [
    "pamelamj",
    "This a great keyboard at a great price!",
    "I just needed a keyboard fast and picked this one because it said it had quiet keys, and it does.  But it's a great keyboard.  Note, I am not gaming on it, just regular stuff.  It is a wired keyboard that must be plugged into a USB port...no big deal to me.  And I love the rainbow lit keyboard (which you can turn on/off)!!!",
    5.0
  ],
  [
    "Lee Ann Hargrave",
    "Great keyboard for my home office!",
    "This is a great keyboard, very quiet, the keys are lit which is nice for my declining eyesight, touch is great, however, it says in the description that it is waterproof to splashes from drinks but that is just not so.  I just had to order a new one because of it so don't let it get anything wet on it.  I love it so much and the price is so right that I didn't mind ordering again.",
    4.0
  ],
  [
    "Tom in Tubac",
    "Well Made",
    "The keys have a good feel and the legend on the keys won't wear off.  The easily adjustable back light from bright to none is a nice feature.",
    5.0
  ],
  [
    "HB",
    "Keys Are Pretty Quiet - Lightning Is not Blinding - Seems Sturdy",
    "This keyboard has been working great so far. Lights aren't too bright, the keys are pretty quiet, I like FN key functionality. The only thing is that the area to rest your wrists is useless. It's not long or elevated enough to actually support your wrist, unless you have tiny hands or type with you fingers folded at a 90 degree angle. They shouldn't advertise it as such. Other than that, I am pretty satisfied. Time will tell if it lasts long.",
    4.0
  ],
  [
    "Sarah J Chandra",
    "Quiet! Pretty! High Quality!",
    "I have been trying to find a wired keyboard that is actually quiet for a long time because I take notes concurrently when I see clients. All other so-called quiet keyboards have been too loud, but this one is actually super quiet! I love it so much!",
    5.0
  ],
  [
    "J'Bird",
    "Light me up",
    "I didn't think I would like the keyboard but I started using it and I love it.  ❤️ The lights are amazing.",
    5.0
  ],
  [
    "Dirk Lonestar",
    "Getting used to high buttons again… (non-compensated review)",
    "I like it!  I like the lights, the size, and the function of it.  I have become used to lower profile keys now, due to my laptop, and my old keyboard.  But, I like the lights so much, that I am going to get comfortable with the higher keys again.",
    5.0
  ],
  [
    "Shadow Merlin",
    "Cute Color Lights",
    "This keyboard does what it says! The quiet feature of it seemed to go away after a couple of days. It's still pretty quiet, but definitely 'louder' then the first day. Maybe i just have heavy fingers. Colors are super pretty  though in my opinion.",
    4.0
  ],
  [
    "Jennifer K. Bachman",
    "Cute",
    "I like that it’s small.It’s not the normal large keyboard",
    4.0
  ],
  [
    "JMI",
    "Love it",
    "I was a little concerned when I couldn’t figure out how to turn the lights off because I didn’t want rainbow lights all the time, but I figured out and it works great! good price too",
    5.0
  ],
  [
    "A-BUYER",
    "Finish is bad - REFUNDED",
    "Less than 6 moths use and the paint on the keys is wearing away. This seems to be a short term keyboard.They Refunded my money to change my review.",
    5.0
  ],
  [
    "ComputerUser",
    "Wobbly",
    "Keyboard was initially wobbly but promptly resolved by the company. It is exactly as advertised: colorful and a decently deep key press!",
    5.0
  ],
  [
    "Loislane",
    "Love the colors and soft sounds",
    "Love the soft sounds and colors",
    5.0
  ],
  ["ANGELA LYNN ENGLISH", "Love it!", "Beautiful and soft, quiet typing", 5.0],
  [
    "0SilverCloud0",
    "responds well for most gaming",
    "This keyboard is fairly well built and water resistant with water drains in the back. Works and responds well and have a nicely multi functional keyboard lighting . The drawback though is the keyboard lighting setting button placement shortens the space bar. For a right handed player this isn't a problem. But for a left handed player that plays with arrow keys and space bar taps with thumb , this is now very awkward with this keyboard. I have to reach over 3 function size buttons rather then normal two to thumb tap the space bar during gamming. It is the main reason for me that this keyboard doesn't get a full 5 stars. I've learned to stretch my right hand more , but this does delay my response time just a bit while gamming.",
    4.0
  ],
  [
    "Jackalyn Roberts",
    "Love it would definitely recommend",
    "Silent not loud adjustable brightness very comfortable on wrist easy to use",
    5.0
  ],
  [
    "Krystal Stover ",
    "Great Value for the money",
    "Amazing keyboard for the price.",
    5.0
  ],
  [
    "chalkTalkie",
    "It works",
    "Not bad, keys feel good, not too noisy. The paint on the keys started wearing pretty fast. Light have no settings.",
    4.0
  ],
  [
    "Bill Bigelis",
    "Whats not to like?",
    "As soon as i plugged this keyboard in my wife was jealous and wanted one as well.  This is a wired keyboard, which I prefer, and doesn't require batteries.Its fairly quiet, the keys have good response for my typing speed, and the LED lights are cool looking.Plug and play, worked right out of the box attached to my laptop.For the price, I think its a really good deal.",
    5.0
  ],
  [
    "Daniel Kats",
    "Great soft keyboard.",
    "Very quiet keys and easy to install. Plug in and play!",
    5.0
  ],
  [
    "May",
    "Not quiet. LIES!",
    "How loud are the keyboards of everyone writing these reviews claiming this is quiet??? Are y'all using typewriters from the 80s comparatively??? This keyboard is NOT quiet! The rainbow lights are cool but the reason I got this was so clients wouldn't hear my keyboard when I was taking notes and this product defeats that purpose. I'm sending it back and I'm disappointed.",
    3.0
  ],
  [
    "JoelS",
    "It's quiet.",
    "I tend to really pound the keys.  I'm a very fast typist, and somethings it is disruptive to those around me.  This keyboard has a nice soft touch, so when you press the key, you get results, but more importantly, it's super quiet.  I LOVE this.  The back lighting is nice too.If the back edge of the keyboard (near the function keys) were elevated another 1/8\" to 1/4\", that would help.  I feel it's a bit low.  Also, the apron they put on the front of the keyboard isn't really useful.  It's too low to use as a wrist rest to avoid carpal tunnel syndrome.  I use a separate padded wrist rest for that, and this forces it to be an extra inch from the keyboard.  Fix those two issues, and this keyboard is perfect.I attached a picture showing my wrist rest pad and the keyboard.  That gap is not a game breaker, but the keyboard would be better without it.",
    4.0
  ],
  [
    "Steve",
    "good product for a while",
    "I buy two at once, then used it for a month as a heavy gamer any book writer so it gets heavy use and don't know if that's the causes of my issue that makes it lose the star. but keys start to type together after around the month of use and having the C and V or E n Z button coming into your book all when you only want the E or C can get really annoying. Not recommended for book writers if it's the product. Otherwise, it's great for night owl gamers like me.",
    4.0
  ],
  [
    "Nagel",
    "The keys rub off quickly",
    "I was surprised that the coating for the keys rubbed off so quickly. Overall, a nice keyboard.",
    4.0
  ],
  ["Michael Oronzor", "El teclado es americano, trabaja muy bien", "", 5.0],
  [
    "Bookman",
    "Nice keyboard",
    "Looks cool. Has nice bright colors. Plug it in and go. I've tried two others and this is the best one so far.",
    5.0
  ],
  [
    "Parker weaver",
    "Overall very decent keyboard",
    "For the price yoy really can't best this quality",
    5.0
  ],
  [
    "reader",
    "Beautiful keyboard",
    "I absolutely love this keyboard.  I love it so much, I bought two.  It is highlighted with gaming colors which you can turn off or on, tactile feel is great, quiet keys, curved keys that are easy to touch.  And the value is great.  I would highly recommend this keyboard for anyone, especially someone who has to sit at a computer all day.",
    5.0
  ],
  [
    "Dan",
    "good keyboard for the $$$",
    "Bought this for my Mom when she saw my Havic keyboard...she loves it with no complaints.  Mom certified....Mother approved. =)",
    5.0
  ],
  [
    "S. Kozlowski",
    "Quality",
    "Nice keyboard and like how it's quiet. It was first challenging to get used to as I was using a dell keyboard before. I'm a fast Coder and found I can't go as fast on this one. I'm hoping over time thar will improve as this keyboard is not flat,it angles in towards the middleSo the top keyboard angles toward middle and bottom keyboard angles toward middle. The keys are tad taller than dells keyboard. Lights up nicely cuz I do work in the dark. The quality is very good though. Doesn't feel cheap. It should last long time ..",
    4.0
  ],
  ["Liankai Xian", "It works", "It works", 4.0],
  [
    "E. Chavez",
    "Works and is fairly quiet",
    "So far, decent keyboard.  Had to reboot after plugging it in as it was not working correctly.  After reboot, working as expected",
    4.0
  ],
  [
    "Julian Micheal Higares",
    "Small",
    "Keys don’t flow with my typing style could just be me",
    4.0
  ],
  [
    "Kia",
    "Very cool but letters wear off",
    "I love the back lighting, its very fun and makes it enjoyable to use. The lettering is wearing off. I purchased the keyboard exactly 6 months ago and I used it 5 days a week for work. The lights have only stopped working once but after unplugging for about 10 seconds it worked again just fine.",
    3.0
  ],
  [
    "Parker R Watkins",
    "great for the price",
    "Needed a new keyboard and this one is comfortable to use, the rbg works really well, and i travel a lot and it holds up very well.",
    5.0
  ],
  [
    "Shanon E. Thatcher",
    "Super quiet keys for conference calls",
    "Great value. We were looking for silent keys and this works perfectly. Well-made and very pretty back light.",
    5.0
  ],
  [
    "ReneeRae",
    "Contured it best.",
    "I love it!  I can find the home row!!  I wore off the ridges on my last keyboard and would slide around be cause it was flat...same story on my laptop.  I am very happy with it.  I do play games but only Hero Wars...so I don't think that count in the land of gaming.  I do turn off the color sometimes when my eyes are tired, but usually it does not bother me.",
    5.0
  ],
  [
    "Cary B.",
    "Not QUIET",
    "This is advertised as a quiet keyboard.  IT IS NOT.THE VENDOR IS NOW OFFERING ME MONEY IF I REMOVE THIS REVIEW !",
    3.0
  ],
  [
    "Kindle Customer",
    "Great keyboard!",
    "Soft and quiet keys! Great value",
    5.0
  ],
  [
    "GJ",
    "Great customer service",
    "I left my original review below but wanted to update my experience. The company reached out and replaced my keyboard at no cost. The new one works perfectly. Would recommend them to anyone needing computer items they back their product 100%.Everything wasfine with this keyboard until it started doing Enterfunctions with i press the f key. I wrote this review exactly how the keyboard is functioning. Occosionally when pressing thef key it goes to the next line like you press Enter. if i can not get a resolution from the supplier i will have to return it for a replacement that does not malfunction",
    5.0
  ],
  [
    "Jon Moore",
    "Works great like the fill of the keys and back light",
    "Works great like the fill of the keys and back light",
    4.0
  ],
  [
    "Ali",
    "Works really well",
    "My fiancé loved it! Works great and love all the colors",
    5.0
  ],
  [
    "Cheri",
    "Great keyboard",
    "Very comfortable and the keys are easier to type with than my old keyboard - has a very light touch.",
    5.0
  ],
  [
    "Angelica Jordan",
    "Christmas gift for my little brother and he loves it",
    "Beautiful gaming keyboard for the price. Looks nice and works well.",
    5.0
  ],
  [
    "Kindle Customer",
    "Great lighted keyboard",
    "Very quiet lighted kryboard, great for low light situations, kryboard light is soft and not distracting.",
    5.0
  ],
  [
    "stephen m.",
    "Works great",
    "The f keys don’t work on Mac but that’s in the video. Good price and function. If you have a pc then you’re set.",
    5.0
  ],
  [
    "Amanda Y",
    "Good for 4 months",
    "Worked fine for 4 months, but N M , . and ? keys won't type anymore. Looked for debris or mess, did not find anything that would cause the issue, tried on another computer  and it still didn't work. Had to use old keyboard once this went out. Lights look good.",
    3.0
  ],
  [
    "BERNIE WALLS",
    "Pleasantly surprised",
    "I bought this because my previous keyboard's keys were too high for my style. This keyboard is the right height for me and I have no issues. The lights DO NOT have any adjustments, unlike the other one, but I'm OK with it.",
    5.0
  ],
  [
    "Christopher Jones",
    "A gift that was well-received",
    "The product performs as advertised.",
    4.0
  ],
  [
    "Bdiggy",
    "Love it!",
    "Great for low light application. I'd buy another if needed.",
    5.0
  ],
  [
    "johnathon",
    "Its a light up keyboard",
    "its just what it claims to be",
    5.0
  ],
  [
    "PrettyCatEyes",
    "Best lighted keyboard yet",
    "This is my second lighted keyboard and it is by far the best  product. The first one's keys clacked so loud, and this one is quieter than my standard keyboard. Definitely recommend.",
    5.0
  ],
  ["Kurt A Smith Jr", "so great!", "so great. Perfect", 5.0],
  [
    "Al Harrington",
    "Good inexpensive keyboard",
    "My old gaming keyboard was too bulky so I was looking for something smaller and not too expensive.  I'm not a hard-core FPS gamer, but play many games and type a lot.  This fit the bill perfectly for me.",
    5.0
  ],
  [
    "oshirenshi",
    "so far so good",
    "I will update if i have any issue with the keyboard within a years time",
    5.0
  ],
  [
    "Edward Moss/Kathy Moss ",
    "Good all-around keyboard!!",
    "It seems to be a good keyboard.  The lights are bright and look good.  For the price you can't go wrong!!",
    5.0
  ],
  [
    "A.F",
    "Satisfied",
    "Keyboard is nice and quiet.Needed a quiet keyboard, and that is what I received. Seller is also understanding and nice.",
    5.0
  ],
  [
    "Keith",
    "CTRL key defect",
    "I would give the product a 1 star if it wasn't for the awesome customer service from the manufacturer/seller.  The reason for the low review is that in both the original AND replacement keyboards, I immediately realized the CTRL key, when pressed in fairly rapid succession, would skip every third press.  For example, if you hit CTRL CTRL CTRL, the 3rd CTRL keypress would be ignored.  I only notice this because I use CTRL often in some games for certain actions.  However, when I mentioned this defect to the manufacturer, they had a replacement at my door in just a couple of days.  Unfortunately, that one had the same defect.  If you don't use a naked CTRL key press for anything, this product might work for you!",
    2.0
  ],
  [
    "Charles R DuBose",
    "as stated easy to use, lights off or on",
    "for pc",
    4.0
  ],
  [
    "Public name",
    "Cute and it works well",
    "My 8 year old is clumsy and a bit hard on keyboards. This is a perfect price point for cost vs durability. And he loves that it lights up.",
    5.0
  ],
  [
    "Jenna R Dobson",
    "I hate where the color on/off switch is!",
    "The color on/off switch is right in the middle & I bump it a lot & turn off the color. When it first happened I thought I broke it, but it is actually just stupidly placed. Buy a different keyboard.",
    3.0
  ],
  ["Laya", "Great Item", "Love this keyboard . A must buy", 5.0],
  ["maria moctezuma", "Good", "Recommend", 5.0],
  [
    "Snappa83",
    "Love it!",
    "I love this keyboard. It types quietly and the colors are pretty!",
    5.0
  ],
  [
    "Sheena",
    "Does not work",
    "Looks great but there are multiple keys that do NOT work.",
    2.0
  ],
  [
    "SAMANTHA CURRY",
    "Love it ❣️",
    "I absolutely Love this keyboard, It's very pretty,works really great and if I accidentally spill something on it it has drainage holes so it will work no matter what.That is awesome.",
    5.0
  ],
  [
    "Robert L. Thomas-Ball",
    "Great Deal",
    "Works great not much sound from typing and is pretty sturdy.",
    5.0
  ],
  [
    "Dustin Keast",
    "Phenomenal keyboard for the price wasn't expecting it to be this nice",
    "I am really impressed with the lights, the build is solid and feedback/resistance on press is right on",
    5.0
  ],
  [
    "Adam Isaev",
    "Feels premium and comfortable",
    "Very comfortable keyboard",
    5.0
  ],
  [
    "Diego",
    "Exactly as advertised.",
    "Simple, beautiful, and comfortable. Exactly what I wanted.",
    5.0
  ],
  ["Vicki Chambers", "Perfect keyboard!", "Great keyboard! Very quick.", 5.0],
  [
    "Josy",
    "Beautiful and Quiet",
    "This keyboard is so pretty and quiet. I'm in love and will recommend it.",
    5.0
  ],
  [
    "Beth M. Gaby",
    "Comfortable and quiet",
    "I use at work, I am a data entry processor. It is comfortable and quiet.",
    5.0
  ],
  [
    "Kindle Customer Patsy",
    "Keys light up beautifully",
    "Love the keyboard, much more responsive than the one that came with my computer.",
    5.0
  ],
  [
    "Amazon Customer",
    "Quiet, easy typing.",
    "Very quiet, easy typing, great for gaming.",
    5.0
  ],
  [
    "Angelina",
    "NO bueno",
    "The LED lights stop working randomly, and you then have to unplug/plug back in to light up again. Returned first one. Replacement does the same thing.  :(  Pick another brand",
    2.0
  ],
  [
    "Aly G",
    "Nice while it lasted",
    "Keyboard is beautiful with it's layout and colors. Keys are soft and typing is comfortable. Just today the keyboard stopped typing, tried everything in the book to get it going again but nothing. I purchased this on Prime Day so it didn't last that long. Sad to throw in the trash!!!",
    2.0
  ],
  ["Tanesha", "Not for me", "Doesn’t work as advertised", 2.0],
  [
    "Michelle",
    "Broken",
    "I bought it once 2 of the numbers stopped working. Amazon replaced it with a new one and three of the letters stopped working on the replacement. Not sure what the problem is but having the same problem twice probably means it’sa bad product!! I will be buying a completely different one..",
    1.0
  ],
  [
    "J.O.Black",
    "...Kind of cheap",
    "Some of the keys are already squeaking like an old shopping cart. Space bar is showing sighs of starting to stick. Only been using it for a week. Poor quality, feels nice to touch though.",
    2.0
  ],
  [
    "CRUSHEQUITY",
    "Stopped working in 2 weeks",
    "After about 2 weeks it just randomly stopped working right.  It wont let me type PIN in at windows start up and randomly web pages will zoom w/ mouse scroll wheel as if CTRL is held down.  Something is wrong with the CTRL+ALT keys and also randomly it will spazz out and all the buttons will do random things like open web pages, settings ect. when just trying to type with it.Sad, cuz it was a real nice keyboard in terms of feel and I enjoyed the backlight, but it's completely unusuable now and i'm returning it.",
    1.0
  ],
  [
    "jan carlos",
    "The key buttons stopped working after 2 weeks",
    "The key buttons for the letter B did not work",
    2.0
  ],
  [
    "Lawrence A. Mayo",
    "is not visable",
    "i cannot see the face of this keyboard unless I am directly above it!  the face is wiped out at any angle except for right under your face.",
    1.0
  ],
  [
    "BillyB",
    "Somethings fishy",
    "This came a month late and looked used when it came. Limited excuse for why.",
    1.0
  ],
  [
    "Howard",
    "Works very well",
    "Pros:1. Love the RGB lights, they are adjustable, and at the max setting, they are very bright.2. The curvature of the individual keys makes it easier to keep your fingers from moving around on accident. On normal keyboards, your fingers might slide or be misplaced if you are gaming or typing quickly.3. It looks very cool!Cons:1. The keyboard is moderately quiet, not \"whisper silent\" as it says in the description.2. Not very ergonomic, the wrist rest is too low to provide any support for the wrists, so your hands are bent at an awkward angle during usage.Overall a decent, solid keyboard. 7.5/10 I think it'll last me for several years since it seems very durable.",
    4.0
  ],
  ["Rhonda", "Bright, easy to use, works well.", "Really awesome!", 5.0],
  [
    "Uncaged Book Reviews",
    "Nice Keyboard",
    "This is a nice keyboard, it's quiet and responsive and I prefer a wired keyboard over the wireless. Even if you want to keep a backup keyboard at hand, this is an inexpensive selection that would be a good fit. This is also and easy keyboard to adapt to, and coming out of a mechanical keyboard for a long time, this is nice and comfortable. The lights turn on or if you don't like them, they can turn off. I prefer backlit keys, and this is a decent choice.",
    4.0
  ],
  [
    "Rob M.",
    "Quiet, useful keyboard",
    "I previously had a \"gaming keyboard\" with loud, clicky keys.  It felt and worked fine, but the noise was just too much.  This keyboard has good key feel and travel, but is very quiet.  It's illuminated, either solid or \"breathing\", and you can adjust the brightness, but that's about it.  The colors aren't changeable or programmable.  The lighting just gradually goes from green to red to blue left to right.  Which is fine if all you need is an illuminated keyboard for use in the dark.  My laptop recognized the keyboard immediately & with no problems upon plugging it in to a USB hub.  The keycap lettering is legible and the keys are laid out in a standard layout.The Win, FN, and \"light\" keys are near and as large as the Ctrl & Alt.  I'd prefer the Ctrl & Alt to be larger and the other 3 special keys to be smaller.  Other than that I have no complaints.",
    4.0
  ],
  [
    "DelusionalAngel",
    "wonderful!",
    "It's nice and sturdy!  i liked this more than i thought i would",
    5.0
  ],
  [
    "AZ Desert Dweller",
    "Son Loves the Colors",
    "My son has recently discovered colored LED's, so when he saw this he wanted it on our PC.  I don't mind the colors, and it seems to be a pretty quiet and well-made keyboard.",
    4.0
  ],
  [
    "barbre",
    "Finally, a Decent Keyboard",
    "I date back to 7280 IBM keyboards that weight about 20 pounds but where sturdy and reliable.  Most of the keyboards today are junk, and it is hard to find a good one.  This keyboard was a pleasant surprise.  It is light weight, the keys are resistant in a good way, and the feel is right.  This isn't mechanical and the keys are silent, but the resistance is just right.  The lighting options are sparse but it does provide a good backlighting on the keys.  The \"wave\" lighting option is kind of annoying to me but the steady is good.  The only minor complaint is the bottom row of keys angle down which is a bit odd.  It didn't take long to get use to it, just a minor thing.Overall, this is a decent plug and play keyboard that provides the basics and is easy to use.",
    5.0
  ],
  [
    "Vine Reviewer",
    "Great keyboard with one issue",
    "I really like this keyboard. It is quiet, responsive, and comfortable to use. My only issue is the built-in wrist rest, which, being made of hard plastic, isn't much of a wrist rest, and which makes it slightly harder to keep my foam rest in place.",
    4.0
  ],
  [
    "RRev78",
    "Comfortable Keyboard",
    "High quality keyboard. The slanted edge of it makes it comfortable to use throughout my work day. I really enjoy the colorfully lighted keys and the background lights. I only wish it were a little bit brighter because I work near a window and the colors get drowned out.",
    5.0
  ],
  [
    "N",
    "Back to quiet",
    "Got this because my mechanical was getting too loud. This still gives me all the features and click feel without all the noise.",
    5.0
  ],
  [
    "Mike P.",
    "Saved My Bacon",
    "This Gaming Keyboard, 7-Color Rainbow LED Backlit, 104 Keys Quiet Light Up Keyboard was the clutch hero that I needed to help me when every keyboard I owned had failed me.My awesome gaming rig that I built had crashed while I was testing overclock voltages and I needed to access the BIOS, but all the keyboards I currently have are wireless, but they should've also worked like a normal keyboard when plugged in, but they didn't.So, stuck without options and desperate for a solution, this keyboard came down from the heavens to rescue me from the depths of despair I had found myself in.As soon as I plugged in this keyboard it worked, I was able to access the BIOS and run Defaults to restore everything to normal.Overall, I'll always hold on to this keyboard just in case for the moments that the S hits the fan. 5/5 stars.",
    5.0
  ],
  [
    "Ying Z.",
    "Nice keyboard",
    "The keyboard is pretty nice. I like the rainbow background color and there is also a button to remove the light on the keyboard. The response of the keys/buttons are good - so far I did not find any key is not functioning. Be AWARE this is not wireless - meaning it has a cord and sometimes inconvenient for some uses. But I guess it will have better response with the cord. Alright, I'm using it for office/typing purpose so I do not personally use it for gaming. Another thing I don't like about this is the height of the keys. I used to type on laptop a lot and the keys are relatively low. For this one, the keys are very high and not as comfort as the ones I used before",
    5.0
  ],
  [
    "Betty",
    "Great keyboard",
    "Great keyboard .. I love the colorful lights . I also like that it’s flat so you can rest your wrist on it. Very good quality and sturdy. I would definitely recommend this product.",
    5.0
  ],
  [
    "j beal",
    "Returned.",
    "Keyboard did not have delete key, only backspace. A few other buttons were also not included which would’ve been nice. Since I ordered this for work, it did not meet my needs and I returned it. Lights were pretty and keyboard/keys felt nice and worked well, but since it was missing buttons which I use very frequently it went back.",
    2.0
  ],
  [
    "Anthony R.",
    "Good Quality And Quiet",
    "The keyboard quality is pretty cool and the typing sensation is silent and very comfortable.",
    5.0
  ],
  [
    "Stitching Grandma",
    "Not a gamer but a great keyboard",
    "love the lights, love the touch. Learned to type on a manual typewrite right after we gave up the chisel and stone, and have a love / hate relationship with modern keyboards.  This one I love because I can \"feel\" the keys under my fingertips.  Hubby loved it so much I ordered one for his office.",
    5.0
  ],
  [
    "Roxanne Green",
    "I use for every day use",
    "I love this keyboard. It's sturdy and comfortable!",
    5.0
  ],
  [
    "Cayden Hathaway",
    "Works great so far…",
    "I bought this keyboard a bit skeptical because of its price. However so far it has worked great and very bright pretty colors and very easy to use. If you’re looking for a compatible keyboard for you gaming setup this works perfect for its price.",
    5.0
  ],
  [
    "Cody Thomas",
    "Nice light up keyboard",
    "Nice light up display. Buttons feel nice.",
    5.0
  ],
  [
    "Lisa Christoffersen",
    "Love it!",
    "My son is a 911 dispatcher and bought this keyboard for work. He absolutely loves it!",
    5.0
  ],
  ["art", "Money", "Reasonable price with nice features", 5.0],
  ["Eddy", "Awesome", "Quiet. Functions great. Looks great. Great buy.", 5.0],
  [
    "packrat76",
    "Good",
    "Bought as a gift for a family member and they love it.  They like the wrist support feature of it as well.  I believe the backlighting is adjustable all the way to turning it off completely so if that's not desired you have options on it.",
    5.0
  ],
  [
    "Abisai Fuentes",
    "Exceeds Expectations",
    "This wasn't my first pick, I actually wanted a Keyboard with a single color light like white but those either were too low in height or delivery was too long compared to Prime speed. I bought this for my work because I work at night and I like to work with the lights off while watching tv and sometimes I was having a hard time seeing the keys. I like that the lights have 3 different brightness modes, off mode and Breath mode(slow flashing). Key strokes feel great, and some reviews say it's noisy but to me they are quiet and smooth. Overall I am 100% satisfied.",
    5.0
  ],
  ["Samuel Smith Jr", "Worked Great", "Worked Great", 5.0],
  [
    "Amazon Customer",
    "",
    "I never leave review on amazon but this one totally wortg it to take 5min , i have nothing to say at all, i dont like mechanic keyboard and the sound , this one is perfect",
    null
  ],
  ["Seafarer", "", "Good and easy to work on", null],
  [
    "Misslou",
    "",
    "Love the colours and how easy it is to change from breathing to static. Plug and play, so easy, keys are quiet which is important for working from home. Highly recommended.",
    null
  ],
  [
    "Chi Chun Lau",
    "",
    "The light can be annoying, but it's good that I can turn it off with just a press of the button.  The ergonomic design for the wrist area is practically useless.  When I put my fingers on that home row keys, my wrist is not even on that pad at all.  Besides that issue, everything seems good.  Noise level of the keys are quite quiet.",
    null
  ],
  [
    "M Gabb",
    "",
    "Within the first day of use I noticed the space bar is sticky..",
    null
  ]
]
